
#Область ОписаниеПеременных

#КонецОбласти
	   
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьДанныеВТаблицу("ТаблицаТитульный",Параметры);
	ЗагрузитьДанныеВТаблицу("ТаблицаРаздел2",Параметры);
	ЗагрузитьДанныеВТаблицу("ТаблицаРаздел23",Параметры);
	
КонецПроцедуры                                           

&НаСервере
Процедура ЗагрузитьДанныеВТаблицу(ИмяТаблицы,Параметры)
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,ИмяТаблицы) Тогда
		ЭтотОбъект[ИмяТаблицы].Очистить();
		ЭтотОбъект[ИмяТаблицы].Вывести(Параметры[ИмяТаблицы]); 
		УстановитьОриентациюСтраницы(ЭтотОбъект[ИмяТаблицы]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОриентациюСтраницы(ТабДок)
	 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабДок);
	ТабДок.Автомасштаб = Истина;
 		
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаТитульныйПриАктивизации(Элемент)

	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаТитульный", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаздел2ПриАктивизации(Элемент)

	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаРаздел2", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаздел23ПриАктивизации(Элемент)

	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаРаздел23", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаТитульный()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаТитульный");

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаРаздел2()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаРаздел2");

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаРаздел23()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаРаздел23");

КонецПроцедуры

#КонецОбласти
