
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
                                                    
// Функция - Получить представление месяца
//
// Параметры:
//  ДатаНачалаМесяца - Дата	- Дата начала месяца
// 
// Возвращаемое значение:
//  Строка - Представление месяца по переданной дате
//
Функция ПолучитьПредставлениеМесяца(ДатаНачалаМесяца) Экспорт
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

