
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы
                                
// Обработчик обновления 11.0.2.59
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_2_59() Экспорт

	// 2024 год:
	Набор = РегистрыСведений.инкКонфигурацияВыплатВФонды.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	ЗаписьСФР = Неопределено;
	
	Для каждого НаборЗапись Из Набор Цикл
		
		Если НаборЗапись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ОблагаемаяБазаВЗН Тогда
			НаборЗапись.СФР = 2225000;
		ИначеЕсли НаборЗапись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифВПределахЛимита Тогда	
			НаборЗапись.СФР = 30;
		ИначеЕсли НаборЗапись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифСверхЛимита Тогда	
			НаборЗапись.СФР = 15.1;
		ИначеЕсли НаборЗапись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифСвышеМРОТ_1_5_ДляМСБ Тогда	
			НаборЗапись.СФР = 15;
		КонецЕсли;
		
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Обработчик обновления 11.0.0.6
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_0_6() Экспорт
	
	// 2020 год:
	Набор = РегистрыСведений.инкКонфигурацияВыплатВФонды.СоздатьНаборЗаписей();
	Набор.Очистить();
	
	// 		Обл. база на каждого работника с нач. года:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ОблагаемаяБазаВЗН;
	Запись.ПФ		= 1292000;
	Запись.ФСС  	= 912000;
	Запись.ФФОМС	= 0;
	
	//		Тариф в пределах лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифВПределахЛимита;
	Запись.ПФ		= 22;
	Запись.ФСС  	= 2.9;
	Запись.ФФОМС	= 5.10;
	
	// 		Тариф сверх лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифСверхЛимита;
	Запись.ПФ		= 11;
	Запись.ФСС  	= 1.45;
	Запись.ФФОМС	= 2.55;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
