
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиПоУмолчанию();
		
КонецПроцедуры             

&НаКлиенте
Процедура ПриОткрытии(Отказ)        
	
	СформироватьОтчет(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию()
	
	Организация = Справочники.инкОрганизации.ПолучитьТекущуюОрганизацию();
	
	ПериодУдержания.ДатаНачала   	= НачалоГода(ТекущаяДата());
	ПериодУдержания.ДатаОкончания	= КонецГода(ТекущаяДата());  
	
КонецПроцедуры                        

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация",Организация);
	ПараметрыОтчета.Вставить("ПериодУдержания",ПериодУдержания);

	СформироватьОтчетНаСервере(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(ПараметрыОтчета)
	
	МенеджерПечати = РеквизитФормыВЗначение("Отчет");
	ТабличныеДокументыОтчета = МенеджерПечати.СформироватьТабличныеДокументы(ПараметрыОтчета);

	РеестрУведомленийТабличныйДокумент = ТабличныеДокументыОтчета.РеестрУведомлений;
	УстановитьНастройкиТабличногоДокумента(РеестрУведомленийТабличныйДокумент);

КонецПроцедуры 

&НаСервере
Процедура УстановитьНастройкиТабличногоДокумента(ТабличныйДокумент)

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СформироватьОтчет(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПериодУдержанияПриИзменении(Элемент)
	
	СформироватьОтчет(Неопределено);

КонецПроцедуры




