
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьОтчет(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет(Параметры)
	
	МенеджерПечати = РеквизитФормыВЗначение("Отчет");
	ТабличныеДокументыОтчета = МенеджерПечати.СформироватьТабличныеДокументы(Параметры);

	ТитульныйЛист		= ТабличныеДокументыОтчета.ТитульныйЛист;
	ИсчисленныйНалог 	= ТабличныеДокументыОтчета.ИсчисленныйНалог;
	
	УстановитьНастройкиТабличногоДокумента(ТитульныйЛист);
	УстановитьНастройкиТабличногоДокумента(ИсчисленныйНалог);  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиТабличногоДокумента(ТабличныйДокумент)

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры


