
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборПериода", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		Период = ДополнительныеПараметры.Период;
		Сотрудники = РезультатРедактирования.Сотрудники;
        
		ТабличныйДокумент = ПолучитьРасчетныеЛисткиНаСервере(Период,Сотрудники);
        инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",Неопределено);

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборПериодаЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ДопПараметры = Новый Структура("Период",РезультатРедактирования.Период);
		Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект, ДопПараметры);
			   
		ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
			ДопПараметры,
			ЭтотОбъект,
			Новый УникальныйИдентификатор,
			,
			,
			Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Функция ПолучитьРасчетныеЛисткиНаСервере(Период,Сотрудники)
    
    Если Не ЗначениеЗаполнено(Сотрудники) Тогда
        Возврат Неопределено;
    КонецЕсли; 
    
	МенеджерПечати = Обработки.инкРасчетныеЛисты.Создать();
	МенеджерПечати.Сотрудники = Сотрудники;
	МенеджерПечати.Дата1 = Период.ДатаНачала;
	МенеджерПечати.Дата2 = Период.ДатаОкончания;
	ТабличныйДокумент = МенеджерПечати.ПолучитьРасчетныеЛистки();

	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти


