#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Зарплата.Итог("КВыплате");
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидВедомости) Тогда
		ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВБанк;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Заполнение объекта:

Процедура ЗаполнитьВыплатуЗарплаты(ПараметрыЗаполнения,ПервичноеЗаполнение = Ложь) Экспорт
	
	Если ПервичноеЗаполнение Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыЗаполнения);                  
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыЗаполнения.ДокументОснование);                  
		ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВКассу;
		ЭтотОбъект.Номер = "";
		
		Сотрудники = ПараметрыЗаполнения.ДокументОснование.Ведомость.ВыгрузитьКолонку("Сотрудник"); 
		
		ЭтотОбъект.ВидыУдержаний.Очистить();
		Для каждого ВидУдержанияЭлемент Из ПараметрыЗаполнения.ВидыУдержаний Цикл
			ВидУдержанияСтрока = ЭтотОбъект.ВидыУдержаний.Добавить();
			ВидУдержанияСтрока.Удержание = ВидУдержанияЭлемент;
		КонецЦикла;  
		
	КонецЕсли;   
	
	// Дата выплаты:
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаВыплаты) Тогда
		
		ЧислоМесяцаВыплатыЗарплаты = Организация.ЧислоМесяцаВыплатыЗарплаты;
		Если НЕ ЗначениеЗаполнено(ЧислоМесяцаВыплатыЗарплаты) Тогда
			ЧислоМесяцаВыплатыЗарплаты = 15;	
		КонецЕсли;
		ЭтотОбъект.ДатаВыплаты = НачалоМесяца(ПараметрыЗаполнения.ДокументОснование.МесяцНачисления) + 60*60*24*ЧислоМесяцаВыплатыЗарплаты;

		Если ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Аванс Тогда	
			ЭтотОбъект.ДатаВыплаты = КонецМесяца(ПараметрыЗаполнения.ДокументОснование.МесяцНачисления) - 60*60*24;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнениеСтруктура = Новый Структура;	
	ЗаполнениеСтруктура.Вставить("ДокументОснование",ПараметрыЗаполнения.ДокументОснование);
	Если ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВБанк Тогда
		ЗаполнениеСтруктура.Вставить("ЗарплатныйПроект",ЭтотОбъект.ЗарплатныйПроект);	
	КонецЕсли;
	Если ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Зарплата Тогда
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний", ПланыВидовРасчета.инкУдержания.ЗарплатаПредыдущегоМесяца);
	ИначеЕсли ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Аванс Тогда                  
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний", ПланыВидовРасчета.инкУдержания.Аванс);
	Иначе
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний",ЭтотОбъект.ВидыУдержаний.ВыгрузитьКолонку("Удержание"));	
	КонецЕсли;
	
	ВедомостьНаВыплатуЗарплатыТаблица = инкВедомостиСервер.ПолучитьВедомостьПоУдержаниям(ЗаполнениеСтруктура);
	
	ЭтотОбъект.Зарплата.Очистить();
	Для каждого ВедомостьСтрока Из ВедомостьНаВыплатуЗарплатыТаблица Цикл
		
		Если ВедомостьСтрока.КВыплате <> 0 Тогда
			ЗарплатаСтрока = ЭтотОбъект.Зарплата.Добавить();
			ЗаполнитьЗначенияСвойств(ЗарплатаСтрока,ВедомостьСтрока);
		КонецЕсли;
		
	КонецЦикла;             
	
	Если ЭтотОбъект.НомерРеестра = 0 Тогда
		ЭтотОбъект.НомерРеестра = 1;	
	КонецЕсли; 
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Зарплата.Итог("КВыплате");
	
КонецПроцедуры

#КонецОбласти				

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
