
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПараметрыРасчета = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	СформироватьСтруктуруРеквизитовФормы(ПараметрыРасчета, СтруктураРеквизитовФормы);
    
    ЗагрузитьДанныеОтчетаНаФорму(СтруктураРеквизитовФормы,Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанныеОтчетаНаФорму(СтруктураРеквизитовФормы, Отказ)

    ЗагрузитьТабличныеДокументы(СтруктураРеквизитовФормы, Отказ);
    
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Титульный_Лист");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел1");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел1Прил1Подр1_1и1_2");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел1Прил2");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел1Прил3");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел2");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"Раздел3");
    
КонецПроцедуры
 
&НаСервере
Процедура ЗагрузитьТабличныеДокументы(СтруктураРеквизитовФормы, Отказ)
    
    МенеджерПечати = РеквизитФормыВЗначение("Отчет");
    МенеджерПечати.Организация = СтруктураРеквизитовФормы.Организация;
    МенеджерПечати.ПериодКвартала = СтруктураРеквизитовФормы.ПериодКвартала; 
    СтруктураРеквизитовФормы.ТабличныеДокументы = МенеджерПечати.ПолучитьТабличныеДокументы(Отказ);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,ИмяЛиста)
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТабличныеДокументы) Тогда
		Возврат;	
	КонецЕсли;
	
    ТабличныйДокумент = СтруктураРеквизитовФормы.ТабличныеДокументы[ИмяЛиста]; 
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;

    ЭтотОбъект["м"+ИмяЛиста] = ТабличныйДокумент;
    
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы) 
    
	СтруктураРеквизитовФормы = Новый Структура;
    СтруктураРеквизитовФормы.Вставить("Организация");
    СтруктураРеквизитовФормы.Вставить("Подразделение");
    СтруктураРеквизитовФормы.Вставить("ПериодКвартала");
    
    СтруктураРеквизитовФормы.Вставить("ТабличныеДокументы");
	СтруктураРеквизитовФормы.Вставить("ДанныеДляРасчетаВзносов");
	
	СтруктураРеквизитовФормы.Вставить("НаименованиеОтчета", "Расчет по страховым взносам");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
    
    ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы,Параметры);

КонецПроцедуры

#КонецОбласти	  

