
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьОтборСписка(Параметры);	

КонецПроцедуры

&НаСервере
Процедура НастроитьОтборСписка(Параметры)

	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;

    инкОбщийСервер.УстановитьОтборСписка("Организация",Параметры,Список);
    инкОбщийСервер.УстановитьОтборСписка("Подразделение",Параметры,Список);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти




