
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить данные производственного календаря за период 
//
// Параметры:
//  Дата1	 - Дата	 - Начало периода
//  Дата2	 - Дата	 - Конец периода
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные производственного календаря за период 
//
Функция ПолучитьДанныеПроизводственногоКалендаряЗаПериод(Дата1,Дата2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;
	
КонецФункции 
	  
// Функция - Получить данные производственного календаря
//
// Параметры:
//  ПараметрВЗапросе - число или стандартный период - Параметр для запроса; 
//  ВидыДней - Массив - Массив видов дней;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные производсвенного календаря
//
Функция ПолучитьДанныеПроизводственногоКалендаря(ПараметрВЗапросе,ВидыДней = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	|	МЕСЯЦ(ДанныеПроизводственногоКалендаря.Дата) КАК Месяц,
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ДанныеПроизводственногоКалендаря.Год КАК Год,
	|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ДанныеПроизводственногоКалендаря.Год = &Год
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ДанныеПроизводственногоКалендаря.ВидДня В (&ВидыДней)";
	
	Если ТипЗнч(ПараметрВЗапросе) = Тип("Число") Тогда
		Запрос.УстановитьПараметр("Год", ПараметрВЗапросе);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДанныеПроизводственногоКалендаря.Год = &Год","Истина");
	КонецЕсли;                                                                                          
	
	Если ТипЗнч(ПараметрВЗапросе) = Тип("СтандартныйПериод") Тогда
		Запрос.УстановитьПараметр("Дата1", ПараметрВЗапросе.ДатаНачала); 
		Запрос.УстановитьПараметр("Дата2", ПараметрВЗапросе.ДатаОкончания);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2","Истина");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ВидыДней) Тогда
		Запрос.УстановитьПараметр("ВидыДней", ВидыДней);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДанныеПроизводственногоКалендаря.ВидДня В (&ВидыДней)","Истина");
	КонецЕсли;                                                                                          
	
	ПроизводственныйКалендарь = инкПроизводственныйКалендарьСервер.ПолучитьПроизводственныйКалендарьРФ();
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  

// Функция - Получить производственный календарь РФ
// 
// Возвращаемое значение:
//  Ссылка - Производственный календарь РФ
//
Функция ПолучитьПроизводственныйКалендарьРФ() Экспорт
	
	ПроизводственныйКалендарь = Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ");
	Если ПроизводственныйКалендарь.Пустая() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПроизводственныйКалендарь;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
