
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Функция ПолучитьТабличныйДокументПечатьОтпускРасчетПоСреднему(ДокументСсылка)

	МенеджерПечати = Обработки.инкПечатьОтпускРасчетПоСреднему.Создать();
	Возврат МенеджерПечати.ПолучитьПечатныйДокументНаСервере(ДокументСсылка);

КонецФункции

&НаКлиенте
Процедура ПечатьДокумента(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТабличныйДокумент = ПолучитьТабличныйДокументПечатьОтпускРасчетПоСреднему(ТекущиеДанные.Ссылка);
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"",ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	инкОбщийКлиент.УстановитьОтборыНаФорме(Список);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КлючеваяОперация = "Документ.инкОтпускРасчетПоСреднему.ОткрытиеФормы";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

