
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДаннымиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетВзносов(Команда)
	
	КлючеваяОперация = "Обработка.инкРасчетВзносов.ФормированиеОтчетаСводПоВзносамВФонды";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ПараметрыФормы = ПолучитьРасчетВзносовСводНаСервере();   
	УстановитьОриентациюСтраницы(ПараметрыФормы.СводПоСтраховымВзносам);
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ПараметрыФормы.СводПоСтраховымВзносам,"Свод по страховым взносам",ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОриентациюСтраницы(ТабДок)
	 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабДок); 
	ТабДок.ПолеСлева   = 10;
	ТабДок.ПолеСправа  = 5;
	ТабДок.Автомасштаб = Истина;
 		
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДаннымиПоУмолчаниюНаСервере()

	Организация	= Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию();
	// Организация							= Справочники.инкОрганизации.НайтиПоКоду("00-000001");
	// Подразделение						= Справочники.инкПодразделения.ПустаяСсылка();
	// ПериодРасчетаВзносов.ДатаНачала		= НачалоГода(Дата("20200101000000"));
	// ПериодРасчетаВзносов.ДатаОкончания  = КонецГода(Дата("20200101000000"));
	// Сотрудник = Справочники.инкСотрудники.НайтиПоКоду("000000001"); // Абрамов Г.С. 
	ПериодРасчетаВзносов.ДатаНачала		= НачалоГода(ТекущаяДата());
	ПериодРасчетаВзносов.ДатаОкончания  = КонецГода(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасчетВзносовСводНаСервере()
	
	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
	//
	МенеджерРасчета.Инициализация();
	//
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Организация = Организация;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Дата1 = ПериодРасчетаВзносов.ДатаНачала;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Дата2 = ПериодРасчетаВзносов.ДатаОкончания;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.СформироватьТабличныеДокументы = Истина;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.ВидОтчета = "Свод";
	
	//
	МенеджерРасчета.ВыполнитьРасчетВзносов();
	//         
	
	ДанныеСтруктура = Новый Структура;
	ДанныеСтруктура.Вставить("СводПоСтраховымВзносам",МенеджерРасчета.ТабличныеДокументы.СводПоСтраховымВзносам);
	
	Возврат ДанныеСтруктура; 
	  	
КонецФункции

#КонецОбласти
