
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Возвращает процент (число) для расчета:
//
// Параметры:
//  ИспЛистПроцент	 - Перечисление	 - Процент исп. листа;
// 
// Возвращаемое значение:
//   - Число;
//
Функция ПолучитьПроцент(ИспЛистПроцент) Экспорт
	
	ПроцентЧисло = 0;
	
	Если ИспЛистПроцент = Перечисления.инкИсполнительныйЛистПроцент.Процент25 Тогда  
		ПроцентЧисло = 0.25;
	ИначеЕсли ИспЛистПроцент = Перечисления.инкИсполнительныйЛистПроцент.Процент33_33 Тогда
		ПроцентЧисло = 0.3333;
	ИначеЕсли ИспЛистПроцент = Перечисления.инкИсполнительныйЛистПроцент.Процент50 Тогда
		ПроцентЧисло = 0.5;
	КонецЕсли;                                                                               
	
	Возврат ПроцентЧисло;
	
КонецФункции

#КонецОбласти

#КонецЕсли


