
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПериодаИОрганизацииЗавершение", ЭтотОбъект);
	ПараметрыОткрытияФормы = ПолучитьПараметрыОткрытияФормы();
	ОткрытьФорму("ОбщаяФорма.инкВыборСтандартногоПериодаГодКвартал", ПараметрыОткрытияФормы, , , , , ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборПериодаИОрганизацииЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		Если НЕ ЗначениеЗаполнено(РезультатРедактирования.Организация) Тогда
			инкОбщийКлиентСервер.СообщитьПользователю("Внимание! Необходимо выбрать организацию.");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = СформироватьОтчетЕФС_1_Раздел2(РезультатРедактирования);
        ОткрытьФорму("Отчет.инкЕФС_1.Форма.ЕФС_раздел2", ПараметрыФормы, , Истина);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция СформироватьОтчетЕФС_1_Раздел2(ПараметрыОтчета)

	МенеджерПечати = Отчеты.инкЕФС_1.Создать();
	ТабличныеДокументыЕФС_1 = МенеджерПечати.СформироватьТабличныеДокументыЕФС_1(ПараметрыОтчета,"Раздел2");
	
	Возврат ТабличныеДокументыЕФС_1;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОткрытияФормы()
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	ПараметрыОткрытияФормы.Вставить("Организация",Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию());
	//ПараметрыОткрытияФормы.Вставить("Организация",Справочники.инкОрганизации.НайтиПоКоду("000000001"));
	
	ПериодЗапроса = Новый СтандартныйПериод;
	ПериодЗапроса.ДатаНачала = НачалоГода(ТекущаяДата());
	ПериодЗапроса.ДатаОкончания = КонецГода(ТекущаяДата());
	ПараметрыОткрытияФормы.Вставить("Период",ПериодЗапроса);
	
	Возврат ПараметрыОткрытияФормы;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти




