
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.РезультатРасчета.Итог("СуммаНачисления");	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ЗаписьДвижений_инкРеестрБольничныхЛистов();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьНаОснованииИсточника(ДанныеЗаполнения);

КонецПроцедуры 

Процедура ЗаполнитьНаОснованииИсточника(ДанныеЗаполнения) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.инкБольничныйЛист") Тогда
		
		БольничныйДатаНачала = ДанныеЗаполнения.БольничныйДатаНачала;
		БольничныйДатаОкончания = ДанныеЗаполнения.БольничныйДатаОкончания;
		БольничныйЛистДатаВыдачи = ДанныеЗаполнения.БольничныйЛистДатаВыдачи;
		БольничныйЛистНомер = ДанныеЗаполнения.БольничныйЛистНомер;
		ВидПособия = ДанныеЗаполнения.ВидПособия;
		ВидПособияЗаСчетРаботодателя = ДанныеЗаполнения.ВидПособияЗаСчетРаботодателя;
		КоличествоДней = ДанныеЗаполнения.КоличествоДней;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ПроцентОплаты = ДанныеЗаполнения.ПроцентОплаты;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		
	КонецЕсли;

КонецПроцедуры

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкРеестрБольничныхЛистов()
	
	Движения.инкРеестрБольничныхЛистов.Записывать = Истина;
	
	Движение = Движения.инкРеестрБольничныхЛистов.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.БольничныйЛист = ЭтотОбъект.Ссылка;
	Движение.Сумма = ЭтотОбъект.СуммаДокумента;
	
КонецПроцедуры

#КонецОбласти	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
