
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтобразитьЭлементыПоУмолчанию(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьЭлементыПоУмолчанию(Параметры)
	
	Элементы.мВсеПредприятие.Видимость = Ложь;   
	Если Параметры <> Неопределено Тогда
		
		Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"ВсеПредприятие") Тогда
			Элементы.мВсеПредприятие.Видимость = Истина;   		
		КонецЕсли;

		Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Организация") Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		    ЭлементОтбора.Использование = Истина;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		    ЭлементОтбора.ПравоеЗначение = Параметры.Организация;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
	КонецЕсли;

	Закрыть(ПолучитьРезультатВыбора());
	
КонецПроцедуры  

&НаКлиенте
Функция ПолучитьРезультатВыбора()
	
	Если Элементы.мВсеПредприятие.Видимость Тогда
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("ВсеПредприятие",мВсеПредприятие);
		РезультатВыбора.Вставить("Подразделение",Элементы.Список.ТекущаяСтрока);
	Иначе
		РезультатВыбора = Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
	Возврат РезультатВыбора;
	
КонецФункции

&НаКлиенте
Процедура мВсеПредприятиеПриИзменении(Элемент)
	Элементы.Список.Доступность = НЕ мВсеПредприятие;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти	
	
