
#Область ОписаниеПеременных

&НаСервере
Перем мОбъектОтчета;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаВЗНСортПоОблБазе.Очистить();
	СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы);
	
	ТаблицаВЗНСортПоОблБазе.Вывести(Параметры.ТабличныеДокументы.ВзносыСортировкаПоОблагаемойБазе);
	ТаблицаВЗНСортПоФИО.Вывести(Параметры.ТабличныеДокументы.ВзносыСортировкаПоФИО);
	ТаблицаВЗНМСБ.Вывести(Параметры.ТабличныеДокументы.ВзносыМСБ);
	
	УстановитьОриентациюСтраницы(ТаблицаВЗНСортПоОблБазе);
	УстановитьОриентациюСтраницы(ТаблицаВЗНСортПоФИО);
	УстановитьОриентациюСтраницы(ТаблицаВЗНМСБ);
	
	Элементы.ГруппаВзносыСортировкаПоОблагаемойБазе.Видимость = Ложь;
	Элементы.ГруппаВзносыСортировкаПоФИО.Видимость = Ложь;
	Элементы.ГруппаВзносыМСБ.Видимость = Ложь;
	Если СтруктураРеквизитовФормы.ДанныеДляРасчетаВзносов.Организация.ПредприятиеМалогоИлиСреднегоБизнеса Тогда
		Элементы.ГруппаВзносыМСБ.Видимость = Истина;
	Иначе
		Элементы.ГруппаВзносыСортировкаПоОблагаемойБазе.Видимость = Истина;
		Элементы.ГруппаВзносыСортировкаПоФИО.Видимость = Истина;
	КонецЕсли;
 	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаВЗНСортПоОблБазеПриАктивизации(Элемент)                         
	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаВЗНСортПоОблБазе", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВЗНСортПоФИОПриАктивизации(Элемент)

	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаВЗНСортПоФИО", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВЗНМСБПриАктивизации(Элемент)

	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамическиТаблицаВЗНМСБ", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОриентациюСтраницы(ТабДок)
	 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабДок);
	ТабДок.Автомасштаб = Истина;
 		
КонецПроцедуры  

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы) 
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("ТабличныеДокументы");
	СтруктураРеквизитовФормы.Вставить("ДанныеДляРасчетаВзносов");
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы,Параметры);
	
	СтруктураРеквизитовФормы.Вставить("НаименованиеОтчета", "Соцналог");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаВЗНСортПоОблБазе()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаВЗНСортПоОблБазе");

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаВЗНСортПоФИО()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаВЗНСортПоФИО");

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиДинамическиТаблицаВЗНМСБ()
	
	инкОтчетыКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТаблицаВЗНМСБ");

КонецПроцедуры

#КонецОбласти
