
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПечатьЕФС_1_Раздел_1(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытияФормы = ПолучитьПараметрыОткрытияФормы();
	
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
		ПараметрыОткрытияФормы,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЕФС_1_Раздел2(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПериодаИОрганизацииЗавершение", ЭтотОбъект);
	ПараметрыОткрытияФормы = ПолучитьПараметрыОткрытияФормы();
	ОткрытьФорму("ОбщаяФорма.инкВыборСтандартногоПериодаГодКвартал", ПараметрыОткрытияФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ТабличныеДокументыРаздел1 = ПолучитьТабличныйРаздел1(РезультатРедактирования);	
		инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныеДокументыРаздел1,"",ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборПериодаИОрганизацииЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ПараметрыФормы = СформироватьОтчетЕФС_1_Раздел2(РезультатРедактирования);
		
		Если ЭтоВнешняяОбработкаОтчет() Тогда
			ОткрытьФорму("ВнешнийОтчет.инкЕФС_2.Форма.ЕФС_раздел2", ПараметрыФормы, , Истина);
		Иначе
			ОткрытьФорму("Отчет.инкЕФС_2.Форма.ЕФС_раздел2", ПараметрыФормы, , Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Функция ЭтоВнешняяОбработкаОтчет()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Отчет");
	Возврат инкОбщийСервер.ЭтоВнешняяОбработкаОтчет(ОбъектОбработка);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетЕФС_1_Раздел2(ПараметрыОтчета)

	МенеджерПечати = РеквизитФормыВЗначение("Отчет");
	ТабличныеДокументыЕФС_1 = МенеджерПечати.СформироватьТабличныеДокументыЕФС_1(ПараметрыОтчета,"Раздел2");
	
	Возврат ТабличныеДокументыЕФС_1;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПараметрыОткрытияФормы()
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	ПараметрыОткрытияФормы.Вставить("Организация",Справочники.инкОрганизации.ПолучитьТекущуюОрганизацию());
	
	ПериодЗапроса = Новый СтандартныйПериод;
	ПериодЗапроса.ДатаНачала = НачалоГода(ТекущаяДата());
	ПериодЗапроса.ДатаОкончания = КонецГода(ТекущаяДата());
	ПараметрыОткрытияФормы.Вставить("Период",ПериодЗапроса);
	ПараметрыОткрытияФормы.Вставить("НачалоПериода",ПериодЗапроса.ДатаНачала);
	ПараметрыОткрытияФормы.Вставить("КонецПериода",ПериодЗапроса.ДатаОкончания);
	
	Возврат ПараметрыОткрытияФормы;
	
КонецФункции

&НаСервере
Функция ПолучитьТабличныйРаздел1(ПараметрыСтруктура)	

	МенеджерПечати = РеквизитФормыВЗначение("Отчет");
	ТабличныйДокументЕФС = МенеджерПечати.СформироватьТабличныеДокументыЕФС_1(ПараметрыСтруктура,"Раздел1");
	
	Возврат ТабличныйДокументЕФС.Раздел1;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти




