
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДаннымиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиПоУмолчаниюНаСервере()

	Организация	= Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию();
	//Организация	= Справочники.инкОрганизации.НайтиПоКоду("00-000001");
	ПериодРасчета.ДатаНачала	 = НачалоМесяца(ТекущаяДата());
	ПериодРасчета.ДатаОкончания  = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
		
#Область о // Печать:

&НаКлиенте
Процедура ПечатьОтчета(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;	
	КонецЕсли;
	
	ТабличныйДокумент = ПолучитьТабличныйДокумент();
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Персонифицированные сведения о физических лицах",ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьТабличныйДокумент()
	
	МенеджерОтчета = РеквизитФормыВЗначение("Объект");
	//
	МенеджерОтчета.Инициализация();
	//                  
	МенеджерОтчета.Организация = Организация;
	МенеджерОтчета.НомерКорректировки = НомерКорректировки;
	МенеджерОтчета.Дата1 = ПериодРасчета.ДатаНачала;
	МенеджерОтчета.Дата2 = ПериодРасчета.ДатаОкончания;
	МенеджерОтчета.СформироватьОтчет();
	//
	Возврат МенеджерОтчета.ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#Область о // XML файл:

&НаКлиенте
Процедура СформироватьXMLФайл(Команда)
	
	ФайлВыгрузки = СформироватьXMLФайлНаСервере();
	Если НЕ ЗначениеЗаполнено(ФайлВыгрузки.ФайлАдрес) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФайлВыгрузкиАдрес",ФайлВыгрузки.ФайлАдрес);
	ДополнительныеПараметры.Вставить("ИмяФайла",ФайлВыгрузки.ФайлИмя);
	ДополнительныеПараметры.Вставить("ВидКлиента");
	
	#Если ВебКлиент Тогда     
		
		ДополнительныеПараметры.ВидКлиента = "ВебКлиент";	
		
		списокКнопокВопроса = новый СписокЗначений();
		списокКнопокВопроса.Добавить("Сохранить","Сохранить");
		списокКнопокВопроса.Добавить("Отмена","Отмена");
		
		Оповещение = новый ОписаниеОповещения("СохранитьФайлЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	  	ПоказатьВопрос(Оповещение,"Выберите действие",списокКнопокВопроса,30,"Сохранить","Сохранить файл выгрузки?","Отмена");

	#Иначе	
		
		ДополнительныеПараметры.ВидКлиента = "";	

		// Выбор файла для открытия:	
		Режим = РежимДиалогаВыбораФайла.Сохранение;
		Диалог = Новый ДиалогВыбораФайла(Режим);
		Диалог.ПолноеИмяФайла = ДополнительныеПараметры.ИмяФайла;
		
		ОбратныйВызов = Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
		// Открывает диалоговое окно:
		Диалог.Показать(ОбратныйВызов);
		
	#КонецЕсли 	
	 
КонецПроцедуры    

&НаКлиенте
Процедура СохранитьФайлЗавершение(РезультатВопроса,ДополнительныеПараметры) экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ФайлВыгрузкиАдрес = ДополнительныеПараметры.ФайлВыгрузкиАдрес;
	Если ДополнительныеПараметры.ВидКлиента = "ВебКлиент" Тогда

		Если РезультатВопроса = "Сохранить" тогда
			НачатьПолучениеФайлаССервера(ФайлВыгрузкиАдрес,ДополнительныеПараметры.ИмяФайла);
		Иначе
			Возврат;
		КонецЕсли;		

	Иначе                              
		ПутьКФайлу = РезультатВопроса[0];
		НачатьПолучениеФайлаССервера(,ФайлВыгрузкиАдрес, ПутьКФайлу);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьXMLФайлНаСервере()
	
	МенеджерОтчета = РеквизитФормыВЗначение("Объект");
	//
	МенеджерОтчета.Инициализация();
	//                  
	МенеджерОтчета.Организация = Организация;
	МенеджерОтчета.НомерКорректировки = НомерКорректировки;
	МенеджерОтчета.Дата1 = ПериодРасчета.ДатаНачала;
	МенеджерОтчета.Дата2 = ПериодРасчета.ДатаОкончания;
	МенеджерОтчета.СформироватьФайл();
	//
	Возврат МенеджерОтчета.ФайлВыгрузкиСтруктура; 
	
КонецФункции

#КонецОбласти

#КонецОбласти
