
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриказПоКадрам(Команда)
	
	ТабличныйДокумент = ПечатьДокументовНаСервере("ПриказПоКадрам");
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ по кадрам",ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Печать документов:

&НаСервере
Функция ПечатьДокументовНаСервере(ИмяОтчета)
	
	МенеджерПечати = Обработки.инкПечатьПриказПоКадрам.Создать();
	Возврат МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект,ИмяОтчета);
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.Руководитель = Объект.Организация.Руководитель;
КонецПроцедуры                            

#КонецОбласти		 

#КонецОбласти
