
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПараметрыРасчета = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	
	мПрочиеНачисленияТаблица.Очистить();
	Для каждого СотрудникЭлемент из ПараметрыРасчета.Сотрудники Цикл
		НачислениеСтрока = мПрочиеНачисленияТаблица.Добавить();
		НачислениеСтрока.Сотрудник = СотрудникЭлемент;
	КонецЦикла;
	
	Элементы.мПрочиеНачисленияТаблица.Доступность = Ложь;      
	
	РассчитатьИтогиТаблицы();

КонецПроцедуры

&НаКлиенте
Процедура ВвестиСписком(Команда)
	
	СуммаНачисленияСумма = Элементы.мПрочиеНачисленияТаблица.ТекущиеДанные.СуммаНачисления;
	
	Если ЗначениеЗаполнено(СуммаНачисленияСумма) Тогда
		
		ДопПараметры = Новый Структура("СуммаНачисления",СуммаНачисленияСумма);
		
		ТекстВопроса = НСтр("ru = 'Ввести списком "+СуммаНачисленияСумма+"?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьСпискомТЧВедомостьЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьСпискомТЧВедомостьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		КолВо = мПрочиеНачисленияТаблица.Количество()-1;
		СчЦикла = 0;
		Для СчЦикла = 0 По КолВо Цикл
			Элементы.мПрочиеНачисленияТаблица.ДанныеСтроки(СчЦикла)["СуммаНачисления"] = ДопПараметры.СуммаНачисления;
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Начислить(Команда)
	
	Если НЕ ЗначениеЗаполнено(мНачисление) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Внимание! Не заполено начисление. Операция прервана.");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	
	ТекстВопроса = НСтр("ru = 'Выполнить начисление?'");
	Оповещение = Новый ОписаниеОповещения("НасчислитьЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры                                                 

&НаКлиенте
Процедура НасчислитьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ДобавитьВПостоянныеНачисленияНаСервере();
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(мНачисление) Тогда
		
		Элементы.мПрочиеНачисленияТаблица.Доступность = Истина;
		Для каждого НачислениеСтрока Из мПрочиеНачисленияТаблица Цикл
			НачислениеСтрока.Начисление = мНачисление;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура мПрочиеНачисленияТаблицаПриИзменении(Элемент)
	
	РассчитатьИтогиТаблицы();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьИтогиТаблицы()

	мИтогСуммаНачисления = мПрочиеНачисленияТаблица.Итог("СуммаНачисления");
	
КонецПроцедуры

#Область о // Постоянные начисления:

&НаСервере
Процедура ДобавитьВПостоянныеНачисленияНаСервере()

	Если мДобавитьНачисленияВПостоянные Тогда

		Для каждого ПрочееНачисление Из мПрочиеНачисленияТаблица Цикл

			Если ПрочееНачисление.СуммаНачисления = 0 Тогда
				Продолжить;
			КонецЕсли;

			НаборЗаписейПостоянныеНачисления = РегистрыСведений.инкПостоянныеНачисления.СоздатьНаборЗаписей();
			НаборЗаписейПостоянныеНачисления.Отбор.Сотрудник.Установить(ПрочееНачисление.Сотрудник);
			НаборЗаписейПостоянныеНачисления.Отбор.Начисление.Установить(мНачисление);
			
			ЗаписьНабора = НаборЗаписейПостоянныеНачисления.Добавить();
			ЗаписьНабора.Сотрудник	= ПрочееНачисление.Сотрудник;
			ЗаписьНабора.Начисление = мНачисление;
			ЗаписьНабора.Размер = ПрочееНачисление.СуммаНачисления;
			
			НаборЗаписейПостоянныеНачисления.Записать(Истина);
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область о // Перенос в основную форму:

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	         	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("мПрочиеНачисленияТаблица", Неопределено);
	
	Если ЗначениеЗаполнено(мНачисление) Тогда
		ВозвращаемыеСведения.мПрочиеНачисленияТаблица = мПрочиеНачисленияТаблица.Выгрузить();
	КонецЕсли; 
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#КонецОбласти



