
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
//
#КонецОбласти

#Область ОбработчикиСобытий
				
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПроизводственныйКалендарь = ПолучитьПроизводственныйКалендарьРФ();
	Если ПроизводственныйКалендарь = Неопределено Тогда
		Возврат;
	КонецЕсли;

	стрОтборы = Новый Структура;
	стрОтборы.Вставить("Ключ", ПроизводственныйКалендарь);
	ОткрытьФорму("Справочник.ПроизводственныеКалендари.Форма.ФормаЭлемента",стрОтборы);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПроизводственныйКалендарьРФ()
	
	Возврат инкПроизводственныйКалендарьСервер.ПолучитьПроизводственныйКалендарьРФ(); 
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти
