					
#Область о // Сформировать табличные документы:

Функция СформироватьТабличныеДокументы(ПараметрыОтчета) Экспорт
	
	ТабличныеДокументы = Новый Структура;
	ТабличныеДокументы.Вставить("ТитульныйЛист",ПолучитьТитульныйЛист(ПараметрыОтчета));
	ТабличныеДокументы.Вставить("ИсчисленныйНалог",ПолучитьИсчисленныйНалог(ПараметрыОтчета));
	
	Возврат ТабличныеДокументы;
	
КонецФункции

Функция ПолучитьТитульныйЛист(ПараметрыОтчета)

	ТитульныйЛист = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Печать_Форма2023_1_Титульная");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ИНН, 12, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИННШапка",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("КППШапка",ВыводСтрока,ОбластьОтчета);

	ВыводСтрока = ПараметрыОтчета.Организация.Наименование;
	инкОтчетыСервер.ВывестиДанныеВОбласти("НаименованиеОрг",ВыводСтрока,ОбластьОтчета,Истина);
	
	ВыводСтрока = ПараметрыОтчета.Организация.ИФНСКод;
	инкОтчетыСервер.ВывестиДанныеВОбласти("КодНО",ВыводСтрока,ОбластьОтчета);

	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Фамилия;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпФ",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Имя;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпИ",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = ПараметрыОтчета.Организация.Руководитель.Отчество;
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПодпО",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = Формат(ТекущаяДата(),"ДФ=ddMMyyyy");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ДАТА_ПОДПИСИ",ВыводСтрока,ОбластьОтчета);
	
	ТитульныйЛист.Вывести(ОбластьОтчета);
	
	Возврат ТитульныйЛист;
	
КонецФункции

Функция ПолучитьИсчисленныйНалог(ПараметрыОтчета)

	ИсчисленныйНалог = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Печать_Форма2023_1_СумИсчНалог");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");         
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ИНН, 12, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИННШапка",ВыводСтрока,ОбластьОтчета);
	
	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
	инкОтчетыСервер.ВывестиДанныеВОбласти("КППШапка",ВыводСтрока,ОбластьОтчета);   
	
	ПозицияВОтчете = 0;
	//Если ЗначениеЗаполнено(ПараметрыОтчета.НалогСумма) Тогда
	//	
	//	ПозицияВОтчете = ПозицияВОтчете + 1;
	//	
	//	КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ДобавитьМесяц(ПараметрыОтчета.ПериодУдержания.ДатаНачала,1));
	//	
	//	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
	//	ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_"+ПозицияВОтчете,"18210102010011000110",ОбластьОтчета);   
	//	ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.НалогСумма);
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("Период_"+ПозицияВОтчете,КодПериода.КодСФР,ОбластьОтчета);   
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_"+ПозицияВОтчете,Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
	//	инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_"+ПозицияВОтчете,Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
	//	
	//КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОтчета.НДФЛСНСумма) Тогда
		
		ПозицияВОтчете = ПозицияВОтчете + 1;

		КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ПараметрыОтчета.ПериодУдержания.ДатаНачала);

		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_"+ПозицияВОтчете,"18210102210011000110",ОбластьОтчета);   
		ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.НДФЛСНСумма);
		инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("Период_"+ПозицияВОтчете,КодПериода.КодСФР,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_"+ПозицияВОтчете,Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_"+ПозицияВОтчете,Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НДФЛСОсновногоДоходаСумма) Тогда
		
		ПозицияВОтчете = ПозицияВОтчете + 1;

		КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ПараметрыОтчета.ПериодУдержания.ДатаНачала);

		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_"+ПозицияВОтчете,"18210102010011000110",ОбластьОтчета);   
		ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.НДФЛСОсновногоДоходаСумма);
		инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("Период_"+ПозицияВОтчете,КодПериода.КодСФР,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_"+ПозицияВОтчете,Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_"+ПозицияВОтчете,Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
		
	КонецЕсли;  

	Если ЗначениеЗаполнено(ПараметрыОтчета.ВзносыСумма) Тогда   
		
		ПозицияВОтчете = ПозицияВОтчете + 1;

		КодПериода = РегистрыСведений.инкНалоговыеУведомления.ПолучитьКодПериода(ПараметрыОтчета.ПериодУдержания.ДатаНачала);

		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.КПП, 9, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("КППДекл_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		ВыводСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПараметрыОтчета.Организация.ОКТМО, 11, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("КБК_"+ПозицияВОтчете,"18210201000011000160",ОбластьОтчета);   
		ВыводСтрока = ПолучитьСтроковоеПредставлениеЧисла(ПараметрыОтчета.ВзносыСумма);
		инкОтчетыСервер.ВывестиДанныеВОбласти("СумНалогАванс_"+ПозицияВОтчете,ВыводСтрока,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("Период_"+ПозицияВОтчете,КодПериода.КодСФР,ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("НомерМесКварт_"+ПозицияВОтчете,Прав(КодПериода.КодСФР,2),ОбластьОтчета);   
		инкОтчетыСервер.ВывестиДанныеВОбласти("ГОД_"+ПозицияВОтчете,Формат(ПараметрыОтчета.ПериодУдержания.ДатаНачала,"ДФ=yyyy"),ОбластьОтчета);   
		
	КонецЕсли;
	
	ИсчисленныйНалог.Вывести(ОбластьОтчета);
	
	Возврат ИсчисленныйНалог;

КонецФункции                 

Функция ПолучитьСтроковоеПредставлениеЧисла(СуммаЧисло,ДлинаСтроки = 18)
	
	СуммаСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(СуммаЧисло,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="), ДлинаСтроки, " ", "Слева");
	СуммаСтрока = СтрЗаменить(СуммаСтрока,".","");
	
	Возврат СуммаСтрока;
	
КонецФункции
	
#КонецОбласти					
					

																					  
