
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПоУмолчаниюНаСервере(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтметкиВТаблице(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюНаСервере(Параметры)
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Организация") Тогда       
		Организация = Параметры.Организация;
	Иначе
		Организация = Справочники.инкОрганизации.ПолучитьТекущуюОрганизацию();	
	КонецЕсли;

	Период.ДатаНачала = НачалоГода(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	ЗагрузитьПодразделенияНаСервере();	
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗагрузитьПодразделенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиВТаблице(Отметка)
	
	Для каждого ПодразделениеСтрока Из ПодразделенияТаблица Цикл
		ПодразделениеСтрока.ВыборСтроки = Отметка;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)        	
	УстановитьОтметкиВТаблице(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметкиВТаблице(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьВыделение(Команда)
	
	Для каждого ПодразделениеСтрока Из ПодразделенияТаблица Цикл
		ПодразделениеСтрока.ВыборСтроки = Не (ПодразделениеСтрока.ВыборСтроки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ПоискВыбор = Новый Структура("ВыборСтроки",Истина);
	Подразделения = ПодразделенияТаблица.НайтиСтроки(ПоискВыбор);
	
	РезультатВыбора = Новый Массив;
	Для каждого ПодразделениеСтрока из Подразделения Цикл
		РезультатВыбора.Добавить(ПодразделениеСтрока.Подразделение);	
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Подразделения",РезультатВыбора);
	ДополнительныеПараметры.Вставить("Организация",Организация);
	ДополнительныеПараметры.Вставить("Дата1",Период.ДатаНачала);
	ДополнительныеПараметры.Вставить("Дата2",Период.ДатаОкончания);       
	ДополнительныеПараметры.Вставить("Период",Период);       
	
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьПодразделенияНаСервере()
	
	ПодразделенияТаблица.Очистить();
	ПодразделенияОрганизации = инкОбщийСервер.ПолучитьПодразделенияОрганизацииНаСервере(Организация);
	Для каждого ПодразделениеСтрока из ПодразделенияОрганизации Цикл
		
		ПодразделениеФорма = ПодразделенияТаблица.Добавить();
		ПодразделениеФорма.Подразделение = ПодразделениеСтрока.Подразделение;
		ПодразделениеФорма.ВыборСтроки = Истина;
		
	КонецЦикла; 
	
	ПодразделениеФорма = ПодразделенияТаблица.Добавить();
	ПодразделениеФорма.Подразделение = Справочники.инкПодразделения.ПустаяСсылка();
	ПодразделениеФорма.ВыборСтроки = Истина;
	
КонецПроцедуры

#КонецОбласти


