
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДокументСсылка = Документы.инкПриказВКомандировку.НайтиПоНомеру("000000007",Дата("20220101000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТ9(Команда)
	
	ТабличныйДокумент = ПолучитьТабличныйДокумент("Т9"); 
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ на отпуск",ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТ10(Команда)

	ТабличныйДокумент = ПолучитьТабличныйДокумент("Т10"); 
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ на отпуск",ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныйДокумент(ИмяОтчета)
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект.ДокументСсылка,ИмяОтчета);
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

