
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры   

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()

	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);  
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();	
КонецПроцедуры                      

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.Руководитель = Объект.Организация.Руководитель;
КонецПроцедуры                            

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьИсториюПоКадровымДаннымНаСервере(СотрудникСсылка)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеПоСотруднику = ДокументОбъект.ПолучитьИсториюКадровыхДанныхПоСотруднику();
	
	Для каждого ЭлементСтруктуры Из ДанныеПоСотруднику Цикл
		
		ИмяРеквизитаФормы = "ист"+ЭлементСтруктуры.Ключ;
		Если инкОбщийКлиентСервер.ЕстьСвойство(ЭтаФорма,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#Область о // Печать:

&НаКлиенте
Процедура инкПриказОКадровыхИзмененияхТ5(Команда)

	ТабличныйДокумент = ПолучитьТабличныйДокументТ5(); 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;   
	ТабличныйДокумент.АвтоМасштаб = Истина;        
	ТабличныйДокумент.ПолеСлева = 20;
	ТабличныйДокумент.ПолеСправа = 0;
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"",ЭтаФорма);

КонецПроцедуры    

&НаСервере
Функция ПолучитьТабличныйДокументТ5()
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.СформироватьТабличныйДокументТ5();
	
	Возврат ТабличныйДокумент; 
	
КонецФункции 

#КонецОбласти

#КонецОбласти
		 

