
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗагрузитьЗначенияРеквизитовПоУмолчанию();
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
	
	ДанныеСтруктура = Новый Структура;
	ДанныеСтруктура.Вставить("Организация", мОрганизация);
	ДанныеСтруктура.Вставить("Подразделение", мПодразделение);
	ДанныеСтруктура.Вставить("ПериодКвартала", инкОбщийСервер.СтандартныйПериодПоГодуИПериодуРегламентногоОтчета(мГод,мПериодОтчета));
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресПараметровВХранилище", инкОбщийСервер.АдресПараметровВХранилище(ДанныеСтруктура,УникальныйИдентификатор));
	
	ПолноеИмяФормыСтрока = инкОбщийКлиент.ПолучитьПолноеИмяФормы(ЭтаФорма,"ФормаОтчетаАналитика");
 	ОткрытьФорму(ПолноеИмяФормыСтрока, 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗначенияРеквизитовПоУмолчанию()
    
    мОрганизация = Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию();
	мПериодОтчета = инкОбщийСервер.ПолучитьПериодРегламентногоОтчетаПоДате(ТекущаяДата());
	
	// Отладка:
	//мОрганизация = Справочники.инкОрганизации.НайтиПоНаименованию("ООО ""Инкомсофт""");
	//мГод = Год(ТекущаяДата());
	//мГод = 2020;
	//мПериодОтчета = Перечисления.инкПериодыРегламентныхОтчетов.ПервыйКвартал;
	
КонецПроцедуры

#КонецОбласти	  
