
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мПериодОтчета.ДатаНачала = НачалоКвартала(ТекущаяДата());
	мПериодОтчета.ДатаОкончания = КонецКвартала(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТабличныйДокумент = ПолучитьТабличныйДокумент(); 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
	ТабличныйДокумент.АвтоМасштаб = Истина;        
	ТабличныйДокумент.ПолеСлева = 20;
	ТабличныйДокумент.ПолеСправа = 0;
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расшифровка 6-НДФЛ",ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокумент()
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Инициализация();
	МенеджерПечати.ПериодОтчета = мПериодОтчета;
	ТабличныйДокумент = МенеджерПечати.СформироватьТабличныйДокументРасшифровка6НДФЛ();
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти



