
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ИндивидуальныйКоэффициент = 0 Тогда
		ЭтотОбъект.ИндивидуальныйКоэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)                        
	
	ЭтотОбъект.Сотрудник = Справочники.инкСотрудники.ПустаяСсылка();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Отчеты:

Функция СформироватьТабличныйДокументТ1() Экспорт
	
	Т1ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ПФ_MXL_Т1"); 
	
	ОбластьОтчет = Макет.ПолучитьОбласть("Шапка");
	ОбластьОтчет.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное	= Организация.Наименование;
	ОбластьОтчет.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = Организация.ОКПО;
	ОбластьОтчет.Параметры.СсылкаНаОбъектНомерНаПечать = Номер;
	ОбластьОтчет.Параметры.СсылкаНаОбъектДата = Дата;;
	Т1ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	ОбластьОтчет = Макет.ПолучитьОбласть("Работник");
	ОбластьОтчет.Параметры.РаботаДатаПриема = ДатаПриказа;
	ОбластьОтчет.Параметры.РаботаТрудовойДоговорДатаОкончания = "";
	ОбластьОтчет.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = Сотрудник.ФИО;
	ОбластьОтчет.Параметры.РаботаСотрудникТабельныйНомерНаПечать = Сотрудник.ТабельныйНомер;
	ОбластьОтчет.Параметры.РаботаПодразделениеНаПечать = Подразделение;
	ОбластьОтчет.Параметры.РаботаДолжность = Должность;
	ОбластьОтчет.Параметры.РаботаРазрядКатегорияНаПечать = "";
	ОбластьОтчет.Параметры.РаботаУсловияПриема = "";
	ОбластьОтчет.Параметры.РаботаДистанционнаяРаботаНаПечать = "";
	ОбластьОтчет.Параметры.РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать = Оклад;
	ОбластьОтчет.Параметры.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать = Оклад * СевернаяНадбавка
	                                                                   + Оклад * РайонныйКоэффициент;
	ОбластьОтчет.Параметры.РаботаДлительностьИспытательногоСрока = "";
	ОбластьОтчет.Параметры.РаботаТрудовойДоговорДатаОформленияНаПечать = ДатаПриказа;
	ОбластьОтчет.Параметры.РаботаТрудовойДоговорНомер = Номер;
	Т1ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	РуководительДанные = Справочники.инкОрганизации.КадровыеДанныеРуководителя(Организация);
	ОбластьОтчет = Макет.ПолучитьОбласть("Подвал");
	ОбластьОтчет.Параметры.СсылкаНаОбъектДолжностьРуководителя = РуководительДанные.Должность;
	ОбластьОтчет.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	= РуководительДанные.ФИОСокращенное;
	ОбластьОтчет.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = инкОтчетыСервер.ПолучитьШаблонДляЗаполненияДатыОзнакомления();
	Т1ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	Возврат Т1ТабличныйДокумент;
	
КонецФункции      

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
