
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Проверить доступность сервера
//
// Параметры:
//  ВыводСлужебныхСообщений	 - Булево	 - Признак вывода служебных сообщений
// 
// Возвращаемое значение:
//  Булево - Результат проверки доступности сервера 
//
Функция ПроверитьДоступностьСервера(ВыводСлужебныхСообщений = Истина) Экспорт
	
	ДоступностьСервера = Истина;
	
	URLОперацииPing = ПолучитьКорневойURL() + "hs/PingOK";                             
	
	инкОбщийКлиентСервер.СообщитьПользователю("Обращение к ресурсу: "+URLОперацииPing,ВыводСлужебныхСообщений);
	
	НастройкиПроксиСервера = инкИнтернетСервисы.ПолучитьНастройкуПроксиСервера();
	РезультатПроверки = ИнтернетПоддержкаПользователей.ПроверитьURLДоступен(URLОперацииPing, НастройкиПроксиСервера);
	
	Если Не ПустаяСтрока(РезультатПроверки.ИмяОшибки) Тогда
		ИмяОшибки = РезультатПроверки.ИмяОшибки;
		Сообщение = РезультатПроверки.СообщениеОбОшибке;
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить информацию о доступном обновлении.
				|Не удалось проверить доступность сервиса автоматического обновления программы: %1.
				|Причина:
				|%2'"),
			URLОперацииPing,
			РезультатПроверки.ИнформацияОбОшибке);
		ПолучениеОбновленийПрограммы.ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке);    
		
		ДоступностьСервера = Ложь;  
		инкОбщийКлиентСервер.СообщитьПользователю("Сервер регистрации не доступен. Описание ошибки: "+ИнформацияОбОшибке,ВыводСлужебныхСообщений);  
	Иначе
		инкОбщийКлиентСервер.СообщитьПользователю("Сервер регистрации доступен.",ВыводСлужебныхСообщений);
	КонецЕсли;

	Возврат ДоступностьСервера;
	
КонецФункции             

// Функция - Получает корневой URL веб сервера Инкомсофт:
// 
// Возвращаемое значение:
//   - Строка
//
Функция ПолучитьКорневойURL() Экспорт
	
	АдресСайтаАПИ = Константы.инкСсылкаНаСлужебныйВебСайтИнкомсофт.Получить();
	КорневойURL = АдресСайтаАПИ + "/inccrmapi/";
	
	Возврат КорневойURL;
	
КонецФункции                 

// Функция - Получает настройку прокси сервера:
// 
// Возвращаемое значение:
//   - Структура
//
Функция ПолучитьНастройкуПроксиСервера() Экспорт
	
	НастройкиПроксиСервера = Неопределено;
	Возврат НастройкиПроксиСервера;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
