
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ВедомостьСтруктура = Новый Структура;
	Если Параметры.Свойство("ДокументОснование") Тогда
		Параметры.ВедомостьСтруктура.Вставить("ДокументОснование",Параметры.ДокументОснование);		
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчанию();
	УстановитьДоступностьРеквизитовНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	ЭтотОбъект.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Зарплата;
	
	УдержанияСоответствие = Новый Соответствие;
	Для каждого УдержаниеСтрока Из Параметры.ВедомостьСтруктура.ДокументОснование.ПрочиеУдержания Цикл
		УдержанияСоответствие.Вставить(УдержаниеСтрока.Удержание,УдержаниеСтрока.Удержание);	
	КонецЦикла;                                                                             
	ЭтотОбъект.ВидыУдержаний.Очистить();
	Для каждого УдержаниеЭлемент Из УдержанияСоответствие Цикл
		ВидыУдержанийСтрока = ЭтотОбъект.ВидыУдержаний.Добавить();
		ВидыУдержанийСтрока.ВыборСтроки = Истина;
		ВидыУдержанийСтрока.Удержание = УдержаниеЭлемент.Значение;
	КонецЦикла;
	
КонецПроцедуры                           

&НаСервере
Процедура УстановитьДоступностьРеквизитовНаФорме()

	Элементы.ВидыУдержаний.Доступность = Ложь;
	Если ЭтотОбъект.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.ПоВидамУдержаний Тогда
		Элементы.ВидыУдержаний.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыплатыЗарплатыПриИзменении(Элемент)
	
	УстановитьДоступностьРеквизитовНаФорме();

КонецПроцедуры

&НаКлиенте
Процедура СформироватьВедомостьНаВыплатуЗарплаты(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СпособВыплатыЗарплаты", ЭтотОбъект.СпособВыплатыЗарплаты);
	ПараметрыОткрытия.Вставить("ДокументОснование", Параметры.ВедомостьСтруктура.ДокументОснование);
	ПараметрыОткрытия.Вставить("ВидыУдержаний", ПолучитьВыбранныеВидыУдержаний());
	
	ОткрытьФорму("Документ.инкВедомостьНаВыплатуЗарплаты.Форма.ФормаДокумента", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);   
		
	Закрыть();	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыбранныеВидыУдержаний()
	
	ВидыУдержанийМассив = Новый Массив;
	
	Для каждого ВидыУдержанийСтрока Из ВидыУдержаний Цикл
		Если ВидыУдержанийСтрока.ВыборСтроки Тогда
			ВидыУдержанийМассив.Добавить(ВидыУдержанийСтрока.Удержание);	
		КонецЕсли;			
	КонецЦикла;
	
	Возврат ВидыУдержанийМассив;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти


