
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Процедура - Обновление ИБ до версии 11.0.2.1:
//
Процедура ЗаполнитьПроизводсвенныйКалендарьИНормуВремени_11_0_2_1() Экспорт
                                 
	ОбъектОбработки = Обработки.инкЗагрузкаДанныхПроизводственногоКалендаряИНормыВремени.Создать();
	ОбъектОбработки.ЗагрузитьДанныеНаСервере(2021);
	ОбъектОбработки.ЗагрузитьДанныеНаСервере(2022);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
    