
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДокументРасчетаЗарплаты = Документы.инкНачислениеЗарплаты.НайтиПоНомеру("00000000006",Дата("20220101000000"));
	//СотрудникРасчет = Справочники.инкСотрудники.НайтиПоКоду("21742");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимРасчетаДокумента = "ПересчитатьДокумент";
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокумент(Команда)
	
	ПересчитатьДокумент = Ложь;
	Если РежимРасчетаДокумента = "ПересчитатьДокумент" Тогда
		ПересчитатьДокумент = Истина;
	КонецЕсли;
		
	ПерезаполнитьДокументНаСервере(ПересчитатьДокумент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерезаполнитьДокументНаСервере(ПересчитатьДокумент = Ложь)
	
	обНачислениеЗП  = Объект.ДокументРасчетаЗарплаты.ПолучитьОбъект();
	
	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
	МенеджерРасчета.Инициализация(обНачислениеЗП);
	МенеджерРасчета.ДанныеНачисленияЗарплаты.булПерерасчет = ПересчитатьДокумент;
	МенеджерРасчета.ДанныеНачисленияЗарплаты.ВыводитьСлужебныеСообщения = Истина;
	
	Если ЗначениеЗаполнено(СотрудникРасчет) Тогда
		МенеджерРасчета.ДанныеНачисленияЗарплаты.Сотрудники.Добавить(СотрудникРасчет);
	КонецЕсли;
	МенеджерРасчета.ВыполнитьРасчетЗаработнойПлаты();
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	Если обНачислениеЗП.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	обНачислениеЗП.Записать(РежимЗаписи);
	
	ЗначениеВРеквизитФормы(МенеджерРасчета, "Объект");

	инкОбщийКлиентСервер.СообщитьПользователю("Записан документ: "+обНачислениеЗП.Ссылка);
	
КонецПроцедуры

#КонецОбласти




