
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ОтпускРасчетПоСреднему = Документы.инкОтпускРасчетПоСреднему.НайтиПоНомеру("000000001",Дата("20220101000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда)

	ТабличныйДокумент = ПолучитьТабличныйДокумент(); 
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Отпуск/Расчет по-среднему",ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТ60(Команда)
	
	ТабличныйДокумент = ПолучитьТабличныйДокумент("Т60"); 
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Форма Т-60",ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныйДокумент(ВидОтчета = Неопределено)
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект.ОтпускРасчетПоСреднему,ВидОтчета);
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти
