
// Процедура - Обновление 11.0.2.66:
//
Процедура Обновление_11_0_2_66() Экспорт
	
	инкОценкаПроизводительностиСервер.ВключениеАПДЕХНаСервере(); 

	КлючевыеОперацииМассив = Новый Массив;
	НомерПриоритета = 100; // Номер последнего приоритета

	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкРасчетЗарабатнойПлаты.РасчетДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Расчет заработной платы");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",3);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкРасчетВзносов.РасчетДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Расчет взносов (ВЗН)");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",3);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Документ.инкНачислениеЗарплаты.Проведение");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Проведение документа ""Расчет зарплаты""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкРасчетВзносов.ФормированиеОтчетаВзносыВФонды");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Формирование отчета ""Взносы в фонды""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",8);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкРасчетВзносов.ФормированиеОтчетаСводПоВзносамВФонды");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Формирование отчета ""Свод по взносам в фонды""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",8);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкВедомостьНачисленийУдержаний.ФормированиеОтчета");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Формирование отчета ""Ведомость начислений/удержаний""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",8);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкРасчетныеЛисты.ФормированиеОтчета");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Формирование отчета ""Расчетные листки""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",8);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкСводнаяВедомость.ФормированиеОтчета");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Формирование отчета ""Сводная ведомость""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",8);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкВыгрузкаНачисленийЗарплатыВБухгалтерию.ВыгрузкаДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Выгрузка начисленной зарплаты в бухгалтерию");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкЗагрузкаВнешнихНачисленийИнкомсофт10_5.ЗагрузкаДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Загрузка внешних начислений (Инкомсофт: Зарплата и кадры 10.5)");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкЗагрузкаКадровыхДанныхИзБПВЗИК.ЗагрузкаДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Загрузка кадровых данных из БП 3.0 в ЗИК 11");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Обработка.инкЗагрузкаКадровыхДанныхИзРСВ.ЗагрузкаДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Загрузка кадровых данных из РСВ");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Документ.инкОтпускРасчетПоСреднему.ОткрытиеФормы");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Открытие формы документа ""Отпуск""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",5);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Документ.инкОтпускРасчетПоСреднему.РасчетДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Расчет данных в документе ""Отпуск""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",3);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Документ.инкБольничныйЛист.ОткрытиеФормы");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Открытие документа ""Больничный лист""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",3);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
	НомерПриоритета = НомерПриоритета + 1;
	КлючеваяОперацияСтруктура = Новый Структура;
	КлючеваяОперацияСтруктура.Вставить("Имя","Документ.инкБольничныйЛист.РасчетДанных");
	КлючеваяОперацияСтруктура.Вставить("Наименование","Расчет данных в документе ""Больничный лист""");
	КлючеваяОперацияСтруктура.Вставить("Приоритет",НомерПриоритета);
	КлючеваяОперацияСтруктура.Вставить("ЦелевоеВремя",3);
	КлючеваяОперацияСтруктура.Вставить("МинимальноДопустимыйУровень",Перечисления.УровниПроизводительности.Хорошо);
	КлючевыеОперацииМассив.Добавить(инкОценкаПроизводительностиСервер.ДобавитьКлючевуюОперацию(КлючеваяОперацияСтруктура));
	
    инкОценкаПроизводительностиСервер.ДобавитьКлючевыеОперацииВПрофиль("Общая оценка производительности АПДЕХ",КлючевыеОперацииМассив);
	
КонецПроцедуры
