
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"АдресПараметровВХранилище") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	мПараметрыФормы = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	Сотрудники = мПараметрыФормы.Сотрудники;
	
	ЗаполнитьДаннымиФормуНаСервере(Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиФормуНаСервере(Сотрудники)
	
	НачальныйСписокСотрудников.Очистить();
	ВыбранныеСотрудники.Очистить();
	
	Для каждого СотрудникЭлемент Из Сотрудники Цикл
		НачисленияУдержанияВыборСтрока = НачальныйСписокСотрудников.Добавить();
		НачисленияУдержанияВыборСтрока.Сотрудник = СотрудникЭлемент;
	КонецЦикла; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаПеренестиВПравоОдно(Команда)
	
	ТекущиеДанные = Элементы.НачальныйСписокСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СтрокаКУдалению =  ВыбранныеСотрудники.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаКУдалению,ТекущиеДанные);
		НачальныйСписокСотрудников.Удалить(НачальныйСписокСотрудников.Индекс(ТекущиеДанные));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВлевоОдно(Команда)
	
	ТекущиеДанные = Элементы.ВыбранныеСотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СтрокаВыбор=  НачальныйСписокСотрудников.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаВыбор,ТекущиеДанные);
		ВыбранныеСотрудники.Удалить(ВыбранныеСотрудники.Индекс(ТекущиеДанные));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВправоВсе(Команда)
	
	Для каждого СтрокаВыбор Из НачальныйСписокСотрудников Цикл
		СтрокаКУдалению =  ВыбранныеСотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКУдалению,СтрокаВыбор);
	КонецЦикла; 
	
	НачальныйСписокСотрудников.Очистить();
	     	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВлевоВсе(Команда)
	
	Для каждого СтрокаКУдалению Из ВыбранныеСотрудники Цикл
		СтрокаВыбор = НачальныйСписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыбор,СтрокаКУдалению);
	КонецЦикла; 
	
	ВыбранныеСотрудники.Очистить();

КонецПроцедуры 

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ВыбранныеСотрудники.Количество() > 0 Тогда
		
		Если инкОбщийКлиентСервер.ЕстьСвойство(мПараметрыФормы,"ВопросПриВыборе") Тогда

			ДопПараметры = Новый Структура;
			
			ТекстВопроса = НСтр("ru = '"+мПараметрыФормы.ВопросПриВыборе+"'");
			Оповещение = Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Иначе
			Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());	
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());	
	КонецЕсли;                                                   	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Перенос данных в основную форму:

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("Сотрудники", ВыбранныеСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#КонецОбласти
