
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить фактический адрес организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьФактическийАдресОрганизации(ЭтотОбъект) Экспорт
	
	ДанныеСтрока = "";
	ПоискСтруктура = Новый Структура;
	ПоискСтруктура.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ФактическийАдресОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискСтруктура);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		ДанныеСтрока = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат ДанныеСтрока;	
	
КонецФункции    

// Функция - Получить юридический адрес организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьЮридическийАдресОрганизации(ЭтотОбъект) Экспорт
	
	ДанныеСтрока = "";
	ПоискСтруктура = Новый Структура;
	ПоискСтруктура.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ЮридическийАдресОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискСтруктура);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		ДанныеСтрока = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат ДанныеСтрока;	
	
КонецФункции    

// Функция - Получить контактный телефон организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьКонтактныйТелефонОрганизации(ЭтотОбъект) Экспорт
	
	КонтактныйТелефон = "";
	ПоискТелефона = Новый Структура;
	ПоискТелефона.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.КонтактныйТелефонОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискТелефона);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		КонтактныйТелефон = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат КонтактныйТелефон;	
	
КонецФункции    

// Функция - Получает первую не помеченную на удаление организацию:
// 
// Возвращаемое значение:
//   - Ссылка - Справочник "Организации" 
//
Функция ПолучитьТекущуюОрганизацию() Экспорт
	
	ОрганизацияСсылка = Справочники.инкОрганизации.ПустаяСсылка();

	ОрганизацииТаблица = ПолучитьСписокОрганизаций();
	Если ОрганизацииТаблица.Количество() > 0 Тогда
		ОрганизацияСсылка = ОрганизацииТаблица[0].Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;
	
КонецФункции

// Функция - Получить единственную организацию
// 
// Возвращаемое значение:
//   - Ссылка 
//
Функция ПолучитьЕдинственнуюОрганизацию() Экспорт

	ОрганизацияСсылка = Справочники.инкОрганизации.ПустаяСсылка();

	ОрганизацииТаблица = ПолучитьСписокОрганизаций();
	Если ОрганизацииТаблица.Количество() = 1 Тогда
		ОрганизацияСсылка = ОрганизацииТаблица[0].Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;

КонецФункции 

// Функция - Получить список организаций
// 
// Возвращаемое значение:
//   - Таблица значений;
//
Функция ПолучитьСписокОрганизаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкОрганизации.Ссылка КАК Ссылка,
		|	инкОрганизации.ИНН КАК ИНН,
		|	инкОрганизации.КПП КАК КПП,
		|	инкОрганизации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.инкОрганизации КАК инкОрганизации
		|ГДЕ
		|	НЕ инкОрганизации.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОрганизацииТаблица = РезультатЗапроса.Выгрузить();
	
	Возврат ОрганизацииТаблица;
	
КонецФункции

// Функция - Кадровые данные руководителя
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеРуководителя(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Руководитель);

КонецФункции	

// Функция - Кадровые данные бухгалтера
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеБухгалтера(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Бухгалтер);

КонецФункции	

// Функция - Кадровые данные кадровика
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеКадровика(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Кадровик);

КонецФункции

#КонецОбласти

#КонецЕсли
						   
