#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ПроверкаРегистрацииПрограммы(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаРегистрацииПрограммы(Отказ)

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		
		Если НЕ инкОбщийСервер.ПроверкаРегистрацииПрограммы() Тогда

			СписокОрганизаций = Справочники.инкОрганизации.ПолучитьСписокОрганизаций(); 
			Если СписокОрганизаций.Количество() >= 1 Тогда
				Отказ = Истина;
				инкОбщийКлиентСервер.СообщитьПользователю("Ограничение демо версии (одна организация и до 5-ти сотрудников). Пожалуйста зарегистрируйте программу!");
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
