
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиПоСсылке(Команда)            
	
	Если НЕ ЗначениеЗаполнено(Объект.ВебСсылка) Тогда
		Возврат;
	КонецЕсли; 
	
	ПерейтиПоНавигационнойСсылке(Объект.ВебСсылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
