
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.0.2.71
//
// Установка размеров предельных сумм вычетов и мрот.
//
Процедура УстановитьНастройкиСтандартныхВычетов_11_0_2_71() Экспорт
	
	инкСтандартныеВычетыНастройкиМенеджер = РегистрыСведений.инкСтандартныеВычетыНастройки.СоздатьМенеджерЗаписи();
	инкСтандартныеВычетыНастройкиМенеджер.Период = НачалоГода(Дата("20250101000000"));
	инкСтандартныеВычетыНастройкиМенеджер.Мрот                          = 22440;
	инкСтандартныеВычетыНастройкиМенеджер.МаксимальнаяСуммаНаДетей      = 450000;
	инкСтандартныеВычетыНастройкиМенеджер.Записать(Истина);
	  
КонецПроцедуры

// Обработчик обновления УТ 11.0.0.2
//
// Установка размеров предельных сумм вычетов и мрот.
//
Процедура УстановитьНастройкиСтандартныхВычетов_11_0_0_2() Экспорт
	
	инкСтандартныеВычетыНастройкиМенеджер = РегистрыСведений.инкСтандартныеВычетыНастройки.СоздатьМенеджерЗаписи();
	инкСтандартныеВычетыНастройкиМенеджер.Период = НачалоГода(Дата("20200101000000"));
	инкСтандартныеВычетыНастройкиМенеджер.Мрот                          = 12130;
	инкСтандартныеВычетыНастройкиМенеджер.МаксимальнаяСуммаНаДетей      = 350000;
	инкСтандартныеВычетыНастройкиМенеджер.Записать(Истина);
	  
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
