#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ РКОНа сервере
//
// Параметры:
//  ДокументВедомость	 - Ссылка	 - Ссылка на документ (источник данных);
//  Сотрудники			 - Массив	 - Массив из ссылок на справочник "Сотрудники";
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Перечень РКО для печати;
//
Функция ПолучитьПечатныйДокументРКОНаСервере(ДокументВедомость,Сотрудники) Экспорт
	
	МакетВедомости = ПолучитьОбщийМакет("инкПФ_MXL_КО2"); 
	ВедомостьТабличныйДокумент = Новый ТабличныйДокумент;
	
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументВедомость.Организация.Руководитель);
	
	НомерДокументаЧисло = 0;
	Для каждого СотрудникЭлемент Из Сотрудники Цикл
		
		НомерДокументаЧисло = НомерДокументаЧисло + 1;
		
		ПоискСтроки = Новый Структура;
		ПоискСтроки.Вставить("Сотрудник",СотрудникЭлемент);
		
		ЗарплатаМассив = ДокументВедомость.Зарплата.НайтиСтроки(ПоискСтроки);
		
		Для каждого ЗарплатаЭлемент Из ЗарплатаМассив Цикл
			
			//
			СуммаПрописью 		= инкОтчетыСервер.ЧислоПрописьюРублиКопейки(ЗарплатаЭлемент.КВыплате); 
			//

			ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Шапка");
			ОбластьДокумента.Параметры.ПредставлениеОрганизации = ДокументВедомость.Организация;
			ОбластьДокумента.Параметры.ПредставлениеПодразделения = ДокументВедомость.Подразделение;						
			ОбластьДокумента.Параметры.НомерДокумента = НомерДокументаЧисло;	
			ОбластьДокумента.Параметры.ДатаДокумента = ДокументВедомость.ДатаВыплаты;
			ОбластьДокумента.Параметры.ФИОПолучателя = СотрудникЭлемент.ФИО;							
			
			ОбластьДокумента.Параметры.ДебетСубСчет 	= ПланыСчетов.инкХозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
			ОбластьДокумента.Параметры.КредитСубСчет	= ПланыСчетов.инкХозрасчетный.Касса;
			ОбластьДокумента.Параметры.Сумма			= ЗарплатаЭлемент.КВыплате;
			                           		
			ОбластьДокумента.Параметры.Основание = ДокументВедомость.Ссылка; 							
			ОбластьДокумента.Параметры.СуммаПрописью = СуммаПрописью;							
			//ОбластьДокумента.Параметры.СуммаПрописьюПродолжение								
			//ОбластьДокумента.Параметры.Приложение							
			ОбластьДокумента.Параметры.ДолжностьРуководителя = КадровыеДанныеРуководителя.Должность;	
			ОбластьДокумента.Параметры.ФИОРуководителя = ДокументВедомость.Организация.Руководитель;	
			ОбластьДокумента.Параметры.ФИОГлавногоБухгалтера = ДокументВедомость.Организация.Бухгалтер;			
			ОбластьДокумента.Параметры.СуммаПрописью = СуммаПрописью;									
			//ОбластьДокумента.Параметры.СуммаПрописьюПродолжение								
			ОбластьДокумента.Параметры.ДатаДокументаПрописью = Формат(ДокументВедомость.ДатаВыплаты,"ДФ=dd.MM.yyyy");	
			ОбластьДокумента.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = инкКадровыйУчетСервер.ПолучитьДанныеДокументаУдостоверяющегоЛичность(СотрудникЭлемент); 
			//ОбластьДокумента.Параметры.ФИОКассира	
			
			ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
			ВедомостьТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
		
	КонецЦикла;
	

	
	//СуммаДокумента = ДокументВедомость.СуммаДокумента;
	//СуммаДокументаРубли = Цел(СуммаДокумента);
	//СуммаДокументаКопейки = Прав(Строка(100+(СуммаДокумента-СуммаДокументаРубли)*100),2);
	//
	//СуммаДокументаПрописью 		= инкОтчетыСервер.ЧислоПрописьюРублиКопейки(СуммаДокумента); 
	//СуммаДепонированоПрописью 	= инкОтчетыСервер.ЧислоПрописьюРублиКопейки(0);
	//
	//ОбластьДокумента = МакетВедомости.ПолучитьОбласть("ШапкаДокумента");
	//ОбластьДокумента.Параметры.КодПоОКПО 			= ДокументВедомость.Организация.ОКПО; 	
	//ОбластьДокумента.Параметры.НазваниеОрганизации	= ДокументВедомость.Организация;						
	//ОбластьДокумента.Параметры.Подразделение		= ДокументВедомость.Подразделение;					
	//ОбластьДокумента.Параметры.СуммаДок				= СуммаДокументаПрописью;						
	//ОбластьДокумента.Параметры.СуммаДокРублей      	= СуммаДокументаРубли;
	//ОбластьДокумента.Параметры.СуммаДокКопеек       = СуммаДокументаКопейки;
	//ОбластьДокумента.Параметры.РуководительДолжность= ДокументВедомость.Организация.Руководитель.Должность;	
	//ОбластьДокумента.Параметры.Руководитель			= ДокументВедомость.Организация.Руководитель;
	//ОбластьДокумента.Параметры.ГлавныйБухгалтер		= ДокументВедомость.Организация.Бухгалтер;
	//
	//// ПЛАТЕЖНАЯ ВЕДОМОСТЬ:
	//ОбластьДокумента.Параметры.Номер	= ДокументВедомость.Номер;	
	//ОбластьДокумента.Параметры.Дата	    = ДокументВедомость.Дата;
	//ОбластьДокумента.Параметры.ОтчетныйПериодС	= НачалоМесяца(ДокументВедомость.ДатаВыплаты);
	//ОбластьДокумента.Параметры.ОтчетныйПериодПо = КонецМесяца(ДокументВедомость.ДатаВыплаты);
	//ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	//
	//ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Шапка");
	//ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	//
	//Для каждого ЗарплатаСтрока Из ДокументВедомость.Зарплата Цикл
	//	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Строка");
	//	ОбластьДокумента.Параметры.НомерСтроки		= ЗарплатаСтрока.НомерСтроки;
	//	ОбластьДокумента.Параметры.ТабельныйНомер   = ЗарплатаСтрока.Сотрудник.ТабельныйНомер;
	//	ОбластьДокумента.Параметры.Физлицо			= ЗарплатаСтрока.Сотрудник.ФИОСокращенное;
	//	ОбластьДокумента.Параметры.Сумма	        = ЗарплатаСтрока.КВыплате;
	//	ОбластьДокумента.Параметры.ЗаписьОДепонировании	= "";
	//	ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	//КонецЦикла;
	//
	//ОбластьДокумента = МакетВедомости.ПолучитьОбласть("ИтогПоЛисту");
	//ОбластьДокумента.Параметры.ИтогоНаСтранице = СуммаДокумента;	
	//ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	//
	//ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Подвал");  
	//ОбластьДокумента.Параметры.КоличествоЛистов 	= 1;
	//ОбластьДокумента.Параметры.ВсегоВыплачено		= СуммаДокументаПрописью;								
	//ОбластьДокумента.Параметры.ВсегоДепонировано	= СуммаДепонированоПрописью;									
	//ОбластьДокумента.Параметры.КассирДолжность		= "Кассир";	
	//ОбластьДокумента.Параметры.Кассир				= ДокументВедомость.Организация.Бухгалтер;
	//ОбластьДокумента.Параметры.Бухгалтер		 	= ДокументВедомость.Организация.Бухгалтер;
	//ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ВедомостьТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли

