#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"ДокументСсылка") Тогда
		ЗаполнитьФормуНачальнымиДаннымиНаСервере(Параметры.ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНачальнымиДаннымиНаСервере(ДокументСсылка)
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ТабличныеДокументы = ДокументОбъект.СформироватьТабличныеДокументы();
	
	мТаблицаТитульный.Вывести(ТабличныеДокументы.ТитулТаблица);
	мТаблицаРаздел1.Вывести(ТабличныеДокументы.Раздел1Таблица);
	мТаблицаРаздел2.Вывести(ТабличныеДокументы.Раздел2Таблица);
	
	УстановитьОриентациюСтраницы(мТаблицаТитульный);
	УстановитьОриентациюСтраницы(мТаблицаРаздел1);
	УстановитьОриентациюСтраницы(мТаблицаРаздел2);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОриентациюСтраницы(ТабДок)
	 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабДок);
	ТабДок.Автомасштаб = Истина;
 		
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти


