#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ на сервере
//
// Параметры:
//  ДокументСсылка	 - Ссылка	 - Ссылка на документ (источник данных);
//  ИмяОтчета		 - Строка	 - Имя кадрового отчета;
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Отчет "Приказ по кадрам";
//
Функция ПолучитьПечатныйДокументНаСервере(ДокументСсылка,ИмяОтчета) Экспорт
	
	ОтпускТабличныйДокумент = ПолучитьДокументПриказПоКадрам(ДокументСсылка);
	
	Возврат ОтпускТабличныйДокумент;
	
КонецФункции                      

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументПриказПоКадрам(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПриказПоКадрам"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент;

	Если Не ЗначениеЗаполнено(ДокументСсылка.Ссылка) Тогда
		Возврат ОтпускТабличныйДокумент;	
	КонецЕсли;	       
	
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Руководитель);
 	
	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");
	ОбластьДокумента.Параметры.Организация = ДокументСсылка.Организация.Наименование;
	ОбластьДокумента.Параметры.НомерДокумента = ДокументСсылка.Номер;
	ОбластьДокумента.Параметры.ДатаДокумента = ДокументСсылка.ДатаПриказа;
	
	ОбластьДокумента.Параметры.СодержаниеПриказа = ДокументСсылка.СодержаниеПриказа;
	
	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.ДиректорДолжность = КадровыеДанныеРуководителя.Должность;
		ОбластьДокумента.Параметры.РуководительРасшифровка = ДокументСсылка.Руководитель.ФИОСокращенное;
	КонецЕсли;
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ОтпускТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли


