
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ИсходныеДанные = Новый Структура;	
	ИсходныеДанные.Вставить("Дата",НачалоМесяца(ЭтотОбъект.МесяцНачисления));
	ИсходныеДанные.Вставить("Сотрудники",ЭтотОбъект.ВходящееСальдо.ВыгрузитьКолонку("Сотрудник"));
	
	КадровыеДанныеТаблица = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудников(ИсходныеДанные);
	
	Движения.инкВедомости.Записывать = Истина;
	Для Каждого ТекСтрокаВходящееСальдо Из ВходящееСальдо Цикл
		
		Если ТекСтрокаВходящееСальдо.Сумма = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		ПоискСотрудника = Новый Структура("Сотрудник",ТекСтрокаВходящееСальдо.Сотрудник);
		КадровыеДанныеМассив = КадровыеДанныеТаблица.НайтиСтроки(ПоискСотрудника);
		
		Если КадровыеДанныеМассив.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Внимание! По сотруднику: "+ТекСтрокаВходящееСальдо.Сотрудник
			        +" не введены кадровые данные. Проведение документа прервано.");	
			Отказ = Истина;
		КонецЕсли;
		
		Движение = Движения.инкВедомости.Добавить();
		Движение.Период = НачалоМесяца(ЭтотОбъект.МесяцНачисления);
		Движение.ИсточникФинансирования = ЭтотОбъект.ИсточникФинансирования;
		Движение.Сотрудник = ТекСтрокаВходящееСальдо.Сотрудник;
		Движение.Организация = КадровыеДанныеМассив[0].Организация; 
		Движение.Подразделение = КадровыеДанныеМассив[0].Подразделение;
		Движение.СальдоИсходящее = ТекСтрокаВходящееСальдо.Сумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

