
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьЗначениямиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВедомость(Команда)
	
	ПараметрыОткрытияФормы = инкОтчетыСервер.ПолучитьПараметрыОткрытияФормыВедомости(мДокументНачисленияЗарплаты);
	
	ПолноеИмяФормыСтрока = инкОбщийКлиент.ПолучитьПолноеИмяФормы(ЭтаФорма,"ФормаВедомости");
 	ОткрытьФорму(ПолноеИмяФормыСтрока, 
		ПараметрыОткрытияФормы,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВедомостьПоПериоду(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", инкОбщийСервер.ПолучитьТекущуюОрганизациюНаСервере());
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборПериодаИПодразделений", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ВыборПериодаЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ПараметрыОткрытия = инкОтчетыСервер.ПолучитьПараметрыОткрытияФормыВедомости(РезультатРедактирования);
		
		ПолноеИмяФормыСтрока = инкОбщийКлиент.ПолучитьПолноеИмяФормы(ЭтаФорма,"ФормаВедомости");
	 	ОткрытьФорму(ПолноеИмяФормыСтрока, 
			ПараметрыОткрытия,
			ЭтотОбъект,
			УникальныйИдентификатор,
			,
			,
			,
			РежимОткрытияОкнаФормы.Независимый);

	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчаниюНаСервере()
	
	мДокументНачисленияЗарплаты = Документы.инкНачислениеЗарплаты.НайтиПоНомеру("00000000005",Дата("20220101000000"));
	
КонецПроцедуры

#КонецОбласти
