
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПоУмолчаниюНаСервере(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Дата1",Период.ДатаНачала);
	ДополнительныеПараметры.Вставить("Дата2",Период.ДатаОкончания);
	ДополнительныеПараметры.Вставить("Период",Период);
	ДополнительныеПараметры.Вставить("Организация",Организация);
	
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
	
КонецПроцедуры
                          
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюНаСервере(Параметры)
	
	Период.ДатаНачала = НачалоГода(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(Параметры,"Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
