
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходНДФЛПриИзменении(Элемент)
	
	ДоходНДФЛПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура мСуммаВычетаПриИзменении(Элемент)

	мСуммаВычетаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛПриИзменении(Элемент)
	
	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	
	Оповещение = Новый ОписаниеОповещения("ВыборВычетНДФЛНЗавершение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.инкВычетыНДФЛ.ФормаВыбора", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетНДФЛОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ",Объект.ВычетНДФЛ);
	
	Оповещение = Новый ОписаниеОповещения("ВыборВычетНДФЛНЗавершение",ЭтотОбъект);
	
	ОткрытьФорму("Справочник.инкВычетыНДФЛ.ФормаОбъекта", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВычетНДФЛНЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт

	ЗаполнитьСуммуВычетаНДФЛ();
	
КонецПроцедуры

&НаКлиенте
Процедура Ст9ФЗ212ПриИзменении(Элемент)
	
	Если Объект.МатериальнаяПомощь И Объект.Ст9ФЗ212 Тогда
		Объект.МатериальнаяПомощь = НЕ Объект.Ст9ФЗ212;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальнаяПомощьПриИзменении(Элемент)
	
	Если Объект.МатериальнаяПомощь И Объект.Ст9ФЗ212 Тогда
    	Объект.Ст9ФЗ212  = НЕ Объект.МатериальнаяПомощь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСуммуВычетаНДФЛ()
	
	мСуммаВычета = 0;
	Если ЗначениеЗаполнено(Объект.ВычетНДФЛ) Тогда
		мСуммаВычета = Объект.ВычетНДФЛ.СуммаВычета;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоходНДФЛПриИзмененииНаСервере()
	
	Объект.ВычетНДФЛ = Объект.ДоходНДФЛ.ВычетНДФЛ;
	
КонецПроцедуры

&НаСервере
Процедура мСуммаВычетаПриИзмененииНаСервере()

	ВычетНДФЛОбъект = Объект.ВычетНДФЛ.ПолучитьОбъект();
	ВычетНДФЛОбъект.СуммаВычета = мСуммаВычета;
	ВычетНДФЛОбъект.Записать();

КонецПроцедуры

#КонецОбласти






