
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПоОрганизацииИПодразделениям(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВводныхДанныхЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", инкОбщийСервер.ПолучитьТекущуюОрганизациюНаСервере());
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборПериодаИПодразделений", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСотрудникамОрганизации(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВводныхДанныхЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", инкОбщийСервер.ПолучитьТекущуюОрганизациюНаСервере());
	ПараметрыОткрытия.Вставить("Период", Новый СтандартныйПериод(НачалоГода(ТекущаяДата()),КонецГода(ТекущаяДата())));
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборВводныхДанныхЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		КлючеваяОперация = "Обработка.инкСводнаяВедомость.ФормированиеОтчета";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
		
		ТабличныйДокумент = ПолучитьТабличныйДокументНаСервере(РезультатРедактирования);
		инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Сводная ведомость",ЭтаФорма);
 		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТабличныйДокументНаСервере(РезультатРедактирования)
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	Возврат МенеджерПечати.ПолучитьСводнуюВедомость(РезультатРедактирования);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
