
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНачальныеДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеДанныеНаСервере()

	Объект.Организация = Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию();
	УИДПрограммы = инкОбщийСервер.ПолучитьУИДПрограммы();
	УИДРегистрации = инкОбщийСервер.ПолучитьУИДРегистрации();

	// Отладка: 
	// Объект.Организация = Справочники.инкОрганизации.НайтиПоКоду("00-000001"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьПрограмму(Команда)
	ЗарегистрироватьПрограммуНаСервере();
КонецПроцедуры                           

&НаКлиенте
Процедура РучнаяРегистрацияПриИзменении(Элемент)
	
	Элементы.УИДРегистрации.Доступность = РучнаяРегистрация;
	Элементы.ЗарегистрироватьПрограммуРучнойРежим.Доступность = РучнаяРегистрация;
	Элементы.ГруппаОнлайнРегистрация.Доступность = НЕ РучнаяРегистрация; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
		  
#Область о // Регистрация программы:

&НаСервере
Процедура ЗарегистрироватьПрограммуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для продолжения регистрации программы необходимо выбрать огранизацию.");	
		Возврат;	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Константы.инкУИДРегистрации.Получить()) Тогда
		ОбщегоНазначения.СообщитьПользователю("Программа уже зарегистрирована.");	   
		Возврат;
	КонецЕсли;
	
	МенеджерРегистрации = РеквизитФормыВЗначение("Объект");
	МенеджерРегистрации.ВыполнитьРегистрациюПрограммы();  
	УИДРегистрации = инкОбщийСервер.ПолучитьУИДРегистрации();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗарегистрироватьПрограммуРучнойРежим(Команда)
	ЗарегистрироватьПрограммуРучнойРежимНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьПрограммуРучнойРежимНаСервере()
	
	Попытка
		Константы.инкУИДРегистрации.Установить(УИДРегистрации);
		инкОбщийКлиентСервер.СообщитьПользователю("Программа успешно зарегистрирована.");
	Исключение
		инкОбщийКлиентСервер.СообщитьПользователю("Ошибка при регистрации программы. Описание: "+ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти		

#КонецОбласти
