
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПриказНаВыплатуКомпенсации(ДокументОбъект) Экспорт
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент = ПолучитьПриказНаВыплатуКомпенсацииТабличныйДокумент(ДокументОбъект);
	
	Возврат ПриказНаВыплатуКомпенсацииТабличныйДокумент;
	
КонецФункции                      

Функция ПолучитьПриказНаВыплатуКомпенсацииТабличныйДокумент(ДокументОбъект)
	
	МакетВедомости = ПолучитьМакет("ПриказНаВыплатуКомпенсации"); 
	ПриказНаВыплатуКомпенсацииТабличныйДокумент = Новый ТабличныйДокумент;

	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументОбъект.Руководитель);
 	
	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");
	
	ЗаполнитьЗначенияСвойств(ОбластьДокумента.Параметры,ДокументОбъект);

	ОбластьДокумента.Параметры.НомерДокумента = ДокументОбъект.Номер;
	ОбластьДокумента.Параметры.ДатаДокумента = ДокументОбъект.Дата;
	ОбластьДокумента.Параметры.ПериодС 	= Строка(Формат(ДокументОбъект.ПериодС,"ДФ=dd.MM.yyyy"));
	ОбластьДокумента.Параметры.ПериодПО = Строка(Формат(ДокументОбъект.ПериодПО,"ДФ=dd.MM.yyyy"));
	
	ОбластьДокумента.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьФИО(ДокументОбъект.Должность, 3));

	ФИОСтрока = СклонениеПредставленийОбъектов.ПросклонятьФИО(ДокументОбъект.Сотрудник.ФИО, 3);
	ОбластьДокумента.Параметры.ФИО = ФИОСтрока;

	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.ДиректорДолжность = КадровыеДанныеРуководителя.Должность;
		ОбластьДокумента.Параметры.РуководительРасшифровка = ДокументОбъект.Руководитель.ФИОСокращенное;
	КонецЕсли;
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ПриказНаВыплатуКомпенсацииТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли
