
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВедомостьНаВыплатуЗарплаты = Документы.инкВедомостьНаВыплатуЗарплаты.НайтиПоНомеру("00000000001",Дата("20220101000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВедомости(Команда)

	ТабличныйДокумент = ПолучитьТабличныйДокумент(); 
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Ведомость на выплату зарплаты",ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныйДокумент()
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.ПолучитьПечатныйДокументВедомостиНаСервере(Объект.ВедомостьНаВыплатуЗарплаты);
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти


