
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Печать результатов расчета:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектНачисленияЗарплаты = Документы.инкНачислениеЗарплаты.НайтиПоНомеру("00000000001",Дата("20200101000000"));
	//Сотрудник = Справочники.инкСотрудники.НайтиПоКоду("000000001"); // Абрамов Геннадий Сергеевич
	ПериодПечати.ДатаНачала 	= НачалоГода(ТекущаяДата());
	ПериодПечати.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция ПечатьРезультатовРасчетаНаСервере()
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Инициализация();
	
    Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудники = Новый Массив;
		Сотрудники.Добавить(Сотрудник);
		МенеджерПечати.Сотрудники = Сотрудники;
		
    КонецЕсли;
    
    МенеджерПечати.ДокументОбъект = ОбъектНачисленияЗарплаты.ПолучитьОбъект();	
	
	ТабличныйДокумент = МенеджерПечати.ПолучитьРезультатРасчета();

	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаКлиенте
Процедура ПечатьРезультатовРасчета(Команда)
	
	Если НЕ ЗначениеЗаполнено(ОбъектНачисленияЗарплаты) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для печати результатов расчета необходимо выбрать документ начисления зарплаты!");
        Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = ПечатьРезультатовРасчетаНаСервере();
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область о // Печать расчетных листков:

&НаСервере
Функция ПечатьРасчетныхЛистковНаСервере()
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Инициализация();
	
    МенеджерПечати.Дата1 = ПериодПечати.ДатаНачала;
	МенеджерПечати.Дата2 = ПериодПечати.ДатаОкончания;
    
    Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудники = Новый Массив;
		Сотрудники.Добавить(Сотрудник);
		МенеджерПечати.Сотрудники = Сотрудники;
        
	КонецЕсли;
    
    Если ЗначениеЗаполнено(ОбъектНачисленияЗарплаты) Тогда
    	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        	МенеджерПечати.ДокументОбъект = ОбъектНачисленияЗарплаты.ПолучитьОбъект();		
        КонецЕсли; 
    КонецЕсли; 
    
    ТабличныйДокумент = МенеджерПечати.ПолучитьРасчетныеЛистки();

	Возврат ТабличныйДокумент; 
	    
КонецФункции

&НаКлиенте
Процедура ПечатьРасчетныхЛистков(Команда)
	
	ТабличныйДокумент = ПечатьРасчетныхЛистковНаСервере();
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти



