
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПОПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетКоличестваДней()
	Объект.КоличествоДнейКомандировки = инкУчетВремениСервер.ПолучитьРазницуВДнях(Объект.ПериодС,Объект.ПериодПО);	
КонецПроцедуры

#Область о // Печать документов:

&НаКлиенте
Процедура ПечатьТ9(Команда)
	
	ТабличныйДокумент = ПечатьДокументовНаСервере("Т9");
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ о направлении работника в командировку Т-9",ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТ10(Команда)
	
	ТабличныйДокумент = ПечатьДокументовНаСервере("Т10");
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"КОМАНДИРОВОЧНОЕ УДОСТОВЕРЕНИЕ",ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ПечатьДокументовНаСервере(ИмяОтчета)
	
	МенеджерПечати = Обработки.инкПечатьПриказВКомандировку.Создать();
	Возврат МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект,ИмяОтчета);
	
КонецФункции

#КонецОбласти

#КонецОбласти
