
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПОПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСДопОтпускПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПОДопОтпускПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ВидДополнительногоОтпускаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВидДополнительногоОтпуска) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПериодСДопОтпуск) И ЗначениеЗаполнено(Объект.ПериодПО) Тогда
			Объект.ПериодСДопОтпуск = КонецДня(Объект.ПериодПО) + 1;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетКоличестваДней()
	
	Объект.КоличествоДнейОтпуска = инкУчетВремениСервер.ПолучитьРазницуВДнях(Объект.ПериодС,Объект.ПериодПО,Ложь);	
	Объект.КоличествоДнейДополнительногоОтпуска = инкУчетВремениСервер.ПолучитьРазницуВДнях(Объект.ПериодСДопОтпуск,Объект.ПериодПОДопОтпуск,Ложь);	

КонецПроцедуры

#Область о // Печать документов:

&НаКлиенте
Процедура ПечатьТ6(Команда)
	
	ТабличныйДокумент = ПечатьДокументовНаСервере("Т6");
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ о предоставлении отпуска работнику Т-6",ЭтаФорма);
	
КонецПроцедуры                      

&НаСервере
Функция ПечатьДокументовНаСервере(ИмяОтчета)
	
	МенеджерПечати = Обработки.инкПечатьПриказНаОтпуск.Создать();
	Возврат МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект,ИмяОтчета);
	
КонецФункции

#КонецОбласти

#КонецОбласти





