#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ на сервере
//
// Параметры:
//  ДокументСсылка	 - Ссылка	 - Ссылка на документ (источник данных);
//  ИмяОтчета		 - Строка	 - Имя кадрового отчета;
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Отчет для печати Т-6;
//
Функция ПолучитьПечатныйДокументНаСервере(ДокументСсылка,ИмяОтчета = Неопределено) Экспорт
	
	ОтпускТабличныйДокумент = ПолучитьДокументТ6(ДокументСсылка);
	
	Возврат ОтпускТабличныйДокумент;
	
КонецФункции                      

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументТ6(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПФ_MXL_Т6"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент;

	Если Не ЗначениеЗаполнено(ДокументСсылка.Ссылка) Тогда
		Возврат ОтпускТабличныйДокумент;	
	КонецЕсли;	

	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Сотрудник);
	Если КадровыеДанныеСотрудника = Неопределено Тогда
		Возврат ОтпускТабличныйДокумент;	
	КонецЕсли;
	
	// Шапка:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Шапка");
	ОбластьДокумента.Параметры.РаботаОрганизацияНаименованиеСокращенное	= ДокументСсылка.Организация.Наименование;
	ОбластьДокумента.Параметры.РаботаОрганизацияКодПоОКПО = ДокументСсылка.Организация.ОКПО;			
	ОбластьДокумента.Параметры.СсылкаНаОбъектНомерНаПечать = ДокументСсылка.Номер;		
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНаПечать = ДокументСсылка.Дата;				
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	// Работник:               
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Работник");
	ОбластьДокумента.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВДательномПадеже = ДокументСсылка.Сотрудник.ФИО;
	ОбластьДокумента.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ДокументСсылка.Сотрудник.ТабельныйНомер;
	ОбластьДокумента.Параметры.РаботаПодразделениеНаПечать = КадровыеДанныеСотрудника.Подразделение;										
														
	ОбластьДокумента.Параметры.РаботаДолжность = ДокументСсылка.Должность;
	ОбластьДокумента.Параметры.РаботаРазрядКатегорияНаПечать = "";
	ОбластьДокумента.Параметры.СсылкаНаОбъектНачалоПериодаЗаКоторыйПредоставляетсяОтпускНаПечать = ДокументСсылка.ПериодС;
	ОбластьДокумента.Параметры.СсылкаНаОбъектКонецПериодаЗаКоторыйПредоставляетсяОтпускНаПечать = ДокументСсылка.ПериодПо;
	ОбластьДокумента.Параметры.СсылкаНаОбъектПродолжительностьОсновногоОтпуска = ДокументСсылка.КоличествоДнейОтпуска;	
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачалаОсновногоОтпускаНаПечать = ДокументСсылка.ПериодС;
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончанияОсновногоОтпускаНаПечать = ДокументСсылка.ПериодПо;
	ОбластьДокумента.Параметры.СсылкаНаОбъектОснование = ДокументСсылка.Основание;     
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектДанныеОтпусковВидОтпускаНаименованиеОтпускаНаПечать = ДокументСсылка.ВидОтпуска;
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачалаВсегоНаПечать = ДокументСсылка.ПериодС;
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончанияВсегоНаПечать = ДокументСсылка.ПериодПО;
	ОбластьДокумента.Параметры.СсылкаНаОбъектДанныеОтпусковПродолжительность = ДокументСсылка.КоличествоДнейДополнительногоОтпуска;

	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	// Подвал: 
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Ответственный);
	
	Если КадровыеДанныеСотрудника <> Неопределено Тогда
		ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Подвал");
		ОбластьДокумента.Параметры.СсылкаНаОбъектДолжностьРуководителя = КадровыеДанныеСотрудника.Должность;
		ОбластьДокумента.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи = ДокументСсылка.Ответственный.ФИОСокращенное;
		ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = "";
	КонецЕсли;
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли





