
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	СформироватьОтчет(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ПериодВОтчете = Новый СтандартныйПериод;
	ПериодВОтчете.ДатаНачала	= НачалоГода(ТекущаяДата());
	ПериодВОтчете.ДатаОкончания = КонецГода(ТекущаяДата());
	
	Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект);
			   
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Период",ПериодВОтчете);
	
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
			ПараметрыОткрытия,
			ЭтотОбъект,
			Новый УникальныйИдентификатор,
			,
			,
			Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры   

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ПараметрыВЗапросе = Новый Структура;
		ПараметрыВЗапросе.Вставить("Дата1",РезультатРедактирования.Период.ДатаНачала);
		ПараметрыВЗапросе.Вставить("Дата2",РезультатРедактирования.Период.ДатаОкончания);
		ПараметрыВЗапросе.Вставить("Сотрудники",РезультатРедактирования.Сотрудники);
		ПараметрыВЗапросе.Вставить("Подразделение",РезультатРедактирования.Подразделение);
		ПараметрыВЗапросе.Вставить("Организация",РезультатРедактирования.Организация);

		СформироватьОтчетНаСервере(ПараметрыВЗапросе);
		УстановитьНастройкиТабличныхДокументов();
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетНаСервере(ПараметрыВЗапросе)

	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Инициализация();
	ЗаполнитьЗначенияСвойств(МенеджерПечати,ПараметрыВЗапросе);
	ТабличныеДокументыТ54а = МенеджерПечати.СформироватьТабличныеДокументыТ54а();
	
	мЛицевойСчет = ТабличныеДокументыТ54а.ЛицевойСчет;
	мУдержанияИВзносы = ТабличныеДокументыТ54а.УдержанияИВзносы;
	мРасчетныеЛистки = ТабличныеДокументыТ54а.РасчетныеЛистки;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиТабличныхДокументов()

	УстановитьНастройкиТабличногоДокумента(мЛицевойСчет);
	УстановитьНастройкиТабличногоДокумента(мУдержанияИВзносы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиТабличногоДокумента(ТабличныйДокумент)

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;

КонецПроцедуры

#КонецОбласти
