#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ на сервере
//
// Параметры:
//  ДокументСсылка	 - Ссылка - Ссылка на документ (источник данных); 
//  ИмяОтчета		 - Строка - Имя отчета "Т9" или "Т10";
// 
// Возвращаемое значение:
// 	ТабличныйДокумент  - Кадровый приказ Т-10 или Т-9;
//
Функция ПолучитьПечатныйДокументНаСервере(ДокументСсылка,ИмяОтчета) Экспорт
	
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если Не ЗначениеЗаполнено(ДокументСсылка.Ссылка) Тогда
		Возврат ОтпускТабличныйДокумент;	
	КонецЕсли;	
	
	Если ИмяОтчета = "Т9" Тогда
		ОтпускТабличныйДокумент = ПолучитьДокументТ9(ДокументСсылка);  
	ИначеЕсли ИмяОтчета = "Т10" Тогда	
		ОтпускТабличныйДокумент = ПолучитьДокументТ10(ДокументСсылка);  
	КонецЕсли;
	
	Возврат ОтпускТабличныйДокумент;
	
КонецФункции                      

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументТ9(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПФ_MXL_Т9"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент; 
	
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Сотрудник);
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Ответсвенный);
	
	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");   
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное = ДокументСсылка.Организация;					
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = ДокументСсылка.Организация.ОКПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектНомерНаПечать = ДокументСсылка.Номер;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДата = ДокументСсылка.Дата;				
	ОбластьДокумента.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = ДокументСсылка.Сотрудник.ФИО;				
	ОбластьДокумента.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ДокументСсылка.Сотрудник.ТабельныйНомер;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеСотрудника) Тогда
		ОбластьДокумента.Параметры.РаботаПодразделениеНаПечать = КадровыеДанныеСотрудника.Подразделение;				
		ОбластьДокумента.Параметры.РаботаДолжность = КадровыеДанныеСотрудника.Должность;				
	КонецЕсли;
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектМестоНазначения = ДокументСсылка.Место;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНазначения = "";				
	ОбластьДокумента.Параметры.СсылкаНаОбъектПродолжительность = ДокументСсылка.КоличествоДнейКомандировки;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачала	= ДокументСсылка.ПериодС;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончания = ДокументСсылка.ПериодПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектЦель = ДокументСсылка.Цель;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектКомандировкаЗаСчетСредств = ДокументСсылка.ЗаСчетСредств;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОснование = ДокументСсылка.ОснованиеДляКомандировки;
	
	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.СсылкаНаОбъектДолжностьРуководителя = КадровыеДанныеРуководителя.Должность;				
		ОбластьДокумента.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	 = ДокументСсылка.Ответственный.ФИОСокращенное;				
	КонецЕсли; 
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = "";				
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

Функция ПолучитьДокументТ10(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПФ_MXL_Т10"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент; 
	
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Сотрудник);
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Ответсвенный);

	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");          
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное = ДокументСсылка.Организация;					
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = ДокументСсылка.Организация.ОКПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектНомерНаПечать = ДокументСсылка.Номер;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДата = ДокументСсылка.Дата;				
    ОбластьДокумента.Параметры.ЛичныеДанныеФИОФамилияИмяОтчество = ДокументСсылка.Сотрудник.ФИО;				
	ОбластьДокумента.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ДокументСсылка.Сотрудник.ТабельныйНомер;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеСотрудника) Тогда
		ОбластьДокумента.Параметры.РаботаПодразделениеНаПечать = КадровыеДанныеСотрудника.Подразделение;				
		ОбластьДокумента.Параметры.РаботаДолжность = КадровыеДанныеСотрудника.Должность;	            
	КонецЕсли;
	
	ОбластьДокумента.Параметры.ЛичныеДанныеДокументУдостоверяющийЛичностьПредставление = Справочники.инкСотрудники.ПолучитьДанныеУдостоверяющегоДокументаСотрудника(ДокументСсылка.Сотрудник);							
	ОбластьДокумента.Параметры.СсылкаНаОбъектПродолжительностьБезУчетаВремениВПути = ДокументСсылка.КоличествоДнейКомандировки;
	ОбластьДокумента.Параметры.СсылкаНаОбъектМестоНазначения = ДокументСсылка.Место;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНазначения = "";				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачала	= ДокументСсылка.ПериодС;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончания = ДокументСсылка.ПериодПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектЦель = ДокументСсылка.Цель;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.СсылкаНаОбъектДолжностьРуководителя = КадровыеДанныеРуководителя.Должность;				
		ОбластьДокумента.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	 = ДокументСсылка.Ответственный.ФИОСокращенное;				
	КонецЕсли;
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли
