
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область о //Обработчики событий - справочники:

// Процедура - Перед записью справочники
//
// Параметры:
//  Источник - Объект	 - Источник записи
//  Отказ	 - Булево	 - Признак отказа
//
Процедура ПередЗаписью_Справочники(Источник, Отказ) Экспорт
	
	инкОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	
КонецПроцедуры

#КонецОбласти

#Область о //Обработчики событий - документы:

// Процедура - Перед записью документы
//
// Параметры:
//  Источник		 - Объект	 - Источник события документ
//  Отказ			 - Булево	 - Признак отказа
//  РежимЗаписи		 - РежимЗаписи	 - Режим записи документа
//  РежимПроведения	 - РежимПроведения	 - Режим проведения документа
//
Процедура ПередЗаписью_Документы(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	инкОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	
	// Запись ответственного:
	Если инкОбщийКлиентСервер.ЕстьСвойство(Источник,"Ответственный") Тогда
		Если Не ЗначениеЗаполнено(Источник.Ответственный) ИЛИ Источник.ЭтоНовый() Тогда
			Источник.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Кадровые документы обработка проведения
//
// Параметры:
//  Источник		 - Объект	 - Источник события документ
//  Отказ			 - Булево	 - Признак отказа
//  РежимПроведения	 - РежимПроведения	 - Режим проведения документа
//
Процедура КадровыеДокументы_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	инкЗаписьДвиженийКадровыхДокументов.инкКадроваяИсторияСотрудников(Отказ, РежимПроведения, Источник);
	инкЗаписьДвиженийКадровыхДокументов.инкРеестрКадровыхДокументов(Отказ, РежимПроведения, Источник);
	
КонецПроцедуры

// Процедура - Кадровые документы при записи
//
// Параметры:
//  Источник		 - Объект	 - Источник события документ
//  Отказ			 - Булево	 - Признак отказа
//
Процедура КадровыеДокументы_ПриЗаписи(Источник, Отказ) Экспорт

КонецПроцедуры

// Процедура - Кадровые документы перед записью
//
// Параметры:
//  Источник		 - Объект	 - Источник события документ
//  Отказ			 - Булево	 - Признак отказа
//  РежимЗаписи		 - РежимЗаписи	 - Режим записи документа
//  РежимПроведения	 - РежимПроведения	 - Режим проведения документа
//
Процедура КадровыеДокументы_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(Источник,"ДатаПриказа") Тогда
		Если Не ЗначениеЗаполнено(Источник.ДатаПриказа) Тогда
			Источник.ДатаПриказа = Источник.Дата;
		КонецЕсли;
	КонецЕсли;

	Если инкОбщийКлиентСервер.ЕстьСвойство(Источник,"ВидРабочейНедели") Тогда
		Если Не ЗначениеЗаполнено(Источник.ВидРабочейНедели) Тогда
			Источник.ВидРабочейНедели = Перечисления.инкВидРабочейНедели.Пятидневка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
//
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
